{
	"version": "https://jsonfeed.org/version/1",
	"title": "prose",
	"icon": "https://micro.blog/winterschon/avatar.jpg",
	"home_page_url": "https://prose.winterschon.com/",
	"feed_url": "https://prose.winterschon.com/feed.json",
	"items": [
		
			{
				"id": "http://winterschon.micro.blog/2025/06/06/surprise-million-of-the-bestest.html",
				"title": "🌐 Surprise! 18 Million of the Bestest Money 🌐",
				"content_html": "<p>Sometimes there&rsquo;s a reminder, an initiator of memory and emotions, which occurs upon opening my passport booklet. <em>&ldquo;Oh look! It&rsquo;s millions of Colones!</em>, and with such a uniquely beautiful design. Every time this occurs it provides an unexpected reminder of my favorite country, Costa Rica.</p>\n<p>In association with the country itself, the bills are very pretty, colorfully fun, and durably resistant to humidity and water damage — useful for hiking through cloud and rain forests, diving at a local reef, or being caught out in a multi hour downpour.</p>\n<p>For unknown reasons I left these bills inside of the booklet&rsquo;s secondary tab next to my passport, and now they&rsquo;re going right back into the booklet for a future surprise, and certainly future use during the next visit.</p>\n<p>#travel #surprise #CostaRica</p>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "Sometimes there's a reminder, an initiator of memory and emotions, which occurs upon opening my passport booklet. _\"Oh look! It's millions of Colones!_, and with such a uniquely beautiful design. Every time this occurs it provides an unexpected reminder of my favorite country, Costa Rica.\n\n In association with the country itself, the bills are very pretty, colorfully fun, and durably resistant to humidity and water damage — useful for hiking through cloud and rain forests, diving at a local reef, or being caught out in a multi hour downpour.\n\nFor unknown reasons I left these bills inside of the booklet's secondary tab next to my passport, and now they're going right back into the booklet for a future surprise, and certainly future use during the next visit.\n\n#travel #surprise #CostaRica \n\n<img src=\"uploads/2025/aa5257b8dc.png\" alt=\"An opened booklet for a U.S. passport, some banknotes from Costa Rica, and a smartphone are laid out on a table.\">\n\n<img src=\"uploads/2025/0d31f23838.jpg\" alt=\"Eva standing on a beach near Playa Buena Vista in Costa Rica\">\n\n<video controls src=\"https://prose.winterschon.com/uploads/2025/media.mp4\"></video>\n",
				"date_published": "2025-06-06T14:26:02-05:00",
				"url": "https://prose.winterschon.com/2025/06/06/surprise-million-of-the-bestest.html",
				"tags": ["Photography "]
			},
			{
				"id": "http://winterschon.micro.blog/2025/06/05/episode-leaving-ord-minimalism-yes.html",
				"title": "Episode 44: \"Leaving ORD, minimalism yes please.\"",
				"content_html": "<p>At airport gate, waiting. Originally, a dawn departure.</p>\n<p>Hilton at ORD decides that rooms do not need the usual bathroom items, and prefers the full plastic half-assed attempt at a capsule pod coffee maker. Substantial displeasure occurs, events transpire, and now we&rsquo;re rebooked on flight a few hours later — sleeping in for those hours and have been – words and thoughts – but brain still not really awake. Robin is finding coffees somewhere on the concourse.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "At airport gate, waiting. Originally, a dawn departure. \n\nHilton at ORD decides that rooms do not need the usual bathroom items, and prefers the full plastic half-assed attempt at a capsule pod coffee maker. Substantial displeasure occurs, events transpire, and now we're rebooked on flight a few hours later — sleeping in for those hours and have been – words and thoughts – but brain still not really awake. Robin is finding coffees somewhere on the concourse. \n\n\n\n<img src=\"uploads/2025/747c1da5b9.png\" width=\"479\" height=\"600\" alt=\"\">\n",
				"date_published": "2025-06-05T07:15:20-05:00",
				"url": "https://prose.winterschon.com/2025/06/05/episode-leaving-ord-minimalism-yes.html",
				"tags": ["Musings","Emotive","Photography ","Logistics "]
			},
			{
				"id": "http://winterschon.micro.blog/2025/06/04/episode-were-leaving-take-only.html",
				"title": "Episode 42: \"We're leaving. Take only what you need to survive!\"",
				"content_html": "<p>ETA, 2 hours till movers arrive, in yet another episode of&hellip; &ldquo;Take only what you need to survive&rdquo;, and they&rsquo;re packing up everything else for transit. Countdown to California thereafter.</p>\n<p>Goodbye to another location. I suppose that I could say that Chicago was beneficial in the larger sense of existential purposes, and that much was accomplished, sure sure.</p>\n<p>However, and not in jest, nearly the entirety of those accomplishments could have occurred in an old military quonset hut located off-grid, deep in the vast stretches of the Northern Nevada desert, preferably near the Ruby Mountains. It&rsquo;s far more beautiful out there, truly yes, but the pizza is not delivered, and Chicago does have very good pizza. 🤍</p>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "ETA, 2 hours till movers arrive, in yet another episode of... \"Take only what you need to survive\", and they're packing up everything else for transit. Countdown to California thereafter. \n\nGoodbye to another location. I suppose that I could say that Chicago was beneficial in the larger sense of existential purposes, and that much was accomplished, sure sure.\n\nHowever, and not in jest, nearly the entirety of those accomplishments could have occurred in an old military quonset hut located off-grid, deep in the vast stretches of the Northern Nevada desert, preferably near the Ruby Mountains. It's far more beautiful out there, truly yes, but the pizza is not delivered, and Chicago does have very good pizza. 🤍\n\n<img src=\"uploads/2025/spaceballs-druish-princess-hairdryer.png\" width=\"535\" height=\"594\" alt=\"a screenshot from the movie Spaceballs, in reference to the phrase, take only what you need to survive\">\n\n<img src=\"uploads/2025/ruby-mountains-wilderness-area-nevada.jpg\" width=\"600\" height=\"400\" alt=\"Auto-generated description: A serene mountain lake is surrounded by rocky cliffs and vibrant wildflowers under a clear blue sky.\">\n\n<img src=\"uploads/2025/ruby-mtns-with-ruby-dome.jpg\" width=\"600\" height=\"400\" alt=\"Auto-generated description: Snow-covered mountains with rugged peaks under a partly cloudy sky.\">\n",
				"date_published": "2025-06-04T07:28:27-05:00",
				"url": "https://prose.winterschon.com/2025/06/04/episode-were-leaving-take-only.html",
				"tags": ["Musings","Emotive","Photography ","Logistics "]
			},
			{
				"id": "http://winterschon.micro.blog/2025/06/03/memories-of-a-younger-era.html",
				"title": "Memories of a Younger Era — Tokyo Hiroshima Kyoto",
				"content_html": "<p>Memories of Japan are easy to get lost in, the time period was often a blur. Capsule hotels, bullet trains, insomnia, and several neuro-cognitive mods offering symbiotic boosts to perception. An immediate realization dawned upon landing, so many people seem to love tall western women, to be quite vocal in appreciation and awareness, and hey that&rsquo;s me!</p>\n<p>Those were memories of a pure, simple existence, the joy of living in a beautiful foreign land with a wonderfully kind culture; one where I could not read a single sign, nor understand more than several helpful conversational phrases. A stranger in a strange land. A summer of intense philosophical reassessment, of isolationist meditation, with the majority of months spent traveling alone through four countries across two hemispheres. Circa 2017 feels so far away.</p>\n<p>Perhaps more travel photos will follow. I&rsquo;m in a reflective mood today. 🩷</p>\n<p>#travel #photography #memories</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Memories of Japan are easy to get lost in, the time period was often a blur. Capsule hotels, bullet trains, insomnia, and several neuro-cognitive mods offering symbiotic boosts to perception. An immediate realization dawned upon landing, so many people seem to love tall western women, to be quite vocal in appreciation and awareness, and hey that's me! \n\nThose were memories of a pure, simple existence, the joy of living in a beautiful foreign land with a wonderfully kind culture; one where I could not read a single sign, nor understand more than several helpful conversational phrases. A stranger in a strange land. A summer of intense philosophical reassessment, of isolationist meditation, with the majority of months spent traveling alone through four countries across two hemispheres. Circa 2017 feels so far away.\n\nPerhaps more travel photos will follow. I'm in a reflective mood today. 🩷\n\n#travel #photography #memories\n\n<img src=\"uploads/2025/679df5c17c.png\" width=\"423\" height=\"600\" alt=\"\">\n",
				"date_published": "2025-06-03T08:56:14-05:00",
				"url": "https://prose.winterschon.com/2025/06/03/memories-of-a-younger-era.html",
				"tags": ["Photography "]
			},
			{
				"id": "http://winterschon.micro.blog/2025/06/01/system-migration-complete-and-now.html",
				"title": "System Migration Complete, and Now it's Cherry Time",
				"content_html": "<p>Sunday offers an EOD and EOW wrap up thoughts, with some meandering grammatical expressionism. Present state of this week&rsquo;s hardware resource aggregation into one of the LLM research boxes is&hellip; 98%. The data migration from earlier today is complete, with ZFS offering some enjoyable numbers.</p>\n<blockquote>\n<p>zpool scrub cranking out 19.6G/s, with 2.74T scanned at approx 2min, with the pool predicting a total of 38min to complete</p>\n</blockquote>\n<p>While building the spec and futzing with the BOM, one of my priorities was to ensure zero PCIe lane contention, with I/O going direct to 64 cores at 3.5GHz peaks, and eight memory channels in use (4x ECC-REG + 4x NVDIMM). All of those conditions have been benchmarking well so far; yay for meeting personally set expectations. 🤗</p>\n<p>I&rsquo;d say this is mostly pretty decent for a draid1 array with NVMe on a single-socket Xeon ICX box, and so far much better than the dual socket Ice Lake boxes that I was benching at ${OldOrg}. The recurring two-socket issue on this Xeon generation, and on its successor Sapphire Rapids, is that there&rsquo;s too much cross-socket comms unless specific choices are made with PCIe peripherals and specific choices with BIOS tuning and kernel settings and core-pinning; all of which can be time consuming at a minimum, and head scratching with &ldquo;Just call Premier Support!&rdquo; at the far end, unless you know better.</p>\n<p>This should not come as a surprise to anyone who has been benchmarking multi-socket Xeons ever since Xeons were brought into existence. Having had that experience, and because <em>&ldquo;data + facts + personal experience == real answers&rdquo;</em>, it was simple to predict performance concerns related to cross-socket latency, and don&rsquo;t forget PCIe slot to socket sequencing and NUMA domain crossing, especially when optimizing for high-throughput network based storage transfers. If you scaled a 1 socket to 2 to 4 on the old Nehalem-EX based Xeons, then you know what I mean - they could never match the classic Big Iron vendors' quad-socket designs like Sun&rsquo;s SPARC T3 and M3 series, and certainly not competitive to IBM&rsquo;s POWER7 options.</p>\n<p>Anyway, there&rsquo;s a little game to play in storage server land called, &ldquo;high density rack-scale storage is more efficient with single socket boards, using a high-lane count, high-clock, big cache SKUs&rdquo;. This isn&rsquo;t the time for a lesson in predictive algorithms necessary for resource optimization, ones which should be used when determining cost/benefit analysis of horizontal vs vertical (or combined) storage system scaling at the rack-level; but <strong>it is time</strong> for me to get off of the computer and eat some cherries and watch one of the alternate endings for Cyberpunk 2077 Phantom Liberty!</p>\n<p>And really, for a Sunday evening, remaining at this standing desk in the office-lab is not appealing, particularly due to the <em>&ldquo;it&rsquo;s just too damn hot for pants!&quot;</em> environment, even with the A/C on full blast (common metric for this lab, though it&rsquo;s fine weather for a skirt).</p>\n<p>PS, the pool scub finished with zero errors. I am pleased. Migration complete.</p>\n<p>#linux #zfs #xeon #intel #ibm #sunmicrosystems #storage #hardware #engineering #memories</p>\n",
				"content_text": "Sunday offers an EOD and EOW wrap up thoughts, with some meandering grammatical expressionism. Present state of this week's hardware resource aggregation into one of the LLM research boxes is... 98%. The data migration from earlier today is complete, with ZFS offering some enjoyable numbers.\r\n\r\n> zpool scrub cranking out 19.6G/s, with 2.74T scanned at approx 2min, with the pool predicting a total of 38min to complete\r\n\r\nWhile building the spec and futzing with the BOM, one of my priorities was to ensure zero PCIe lane contention, with I/O going direct to 64 cores at 3.5GHz peaks, and eight memory channels in use (4x ECC-REG + 4x NVDIMM). All of those conditions have been benchmarking well so far; yay for meeting personally set expectations. 🤗\r\n\r\nI'd say this is mostly pretty decent for a draid1 array with NVMe on a single-socket Xeon ICX box, and so far much better than the dual socket Ice Lake boxes that I was benching at ${OldOrg}. The recurring two-socket issue on this Xeon generation, and on its successor Sapphire Rapids, is that there's too much cross-socket comms unless specific choices are made with PCIe peripherals and specific choices with BIOS tuning and kernel settings and core-pinning; all of which can be time consuming at a minimum, and head scratching with \"Just call Premier Support!\" at the far end, unless you know better.\r\n\r\nThis should not come as a surprise to anyone who has been benchmarking multi-socket Xeons ever since Xeons were brought into existence. Having had that experience, and because _\"data + facts + personal experience == real answers\"_, it was simple to predict performance concerns related to cross-socket latency, and don't forget PCIe slot to socket sequencing and NUMA domain crossing, especially when optimizing for high-throughput network based storage transfers. If you scaled a 1 socket to 2 to 4 on the old Nehalem-EX based Xeons, then you know what I mean - they could never match the classic Big Iron vendors' quad-socket designs like Sun's SPARC T3 and M3 series, and certainly not competitive to IBM's POWER7 options.\r\n\r\nAnyway, there's a little game to play in storage server land called, \"high density rack-scale storage is more efficient with single socket boards, using a high-lane count, high-clock, big cache SKUs\". This isn't the time for a lesson in predictive algorithms necessary for resource optimization, ones which should be used when determining cost/benefit analysis of horizontal vs vertical (or combined) storage system scaling at the rack-level; but **it is time** for me to get off of the computer and eat some cherries and watch one of the alternate endings for Cyberpunk 2077 Phantom Liberty! \r\n\r\nAnd really, for a Sunday evening, remaining at this standing desk in the office-lab is not appealing, particularly due to the _\"it's just too damn hot for pants!\"_ environment, even with the A/C on full blast (common metric for this lab, though it's fine weather for a skirt).\r\n\r\nPS, the pool scub finished with zero errors. I am pleased. Migration complete.\r\n\r\n#linux #zfs #xeon #intel #ibm #sunmicrosystems #storage #hardware #engineering #memories\n",
				"date_published": "2025-06-01T20:17:19-05:00",
				"url": "https://prose.winterschon.com/2025/06/01/system-migration-complete-and-now.html",
				"tags": ["Musings","Engineering "]
			},
			{
				"id": "http://winterschon.micro.blog/2025/06/01/need-more-pcie-slots-not.html",
				"title": "Need more PCIe slots, not more lanes, but slots.",
				"content_html": "<p>Staring at this board, mentally converting PCIe lane count to device requirements, only to consider that yet again&hellip;</p>\n<p>It&rsquo;s 2025. We&rsquo;re still using the PCIe slot standard for most motherboards, even on enterprise boards. Who&rsquo;s doing this right, at least marginally so?</p>\n<p>ASRack (brain, please grow up and stop making elementary jokes) has been putting four physical x16 slots on their &ldquo;Deep mini-ITX&rdquo; series of server boards, to which are added two x8 lane Slim-SAS and two x4 lane OcuLink headers. These can be used for a variety of SFF fan-out connection purposes.</p>\n<p>Extensions like this include:</p>\n<ul>\n<li>multi-drive backplane headers for hot-swap 2.5&quot;, 3.5&quot;, U.2, U.3 bays</li>\n<li>additional M.2 slots using a SFF backed PCB</li>\n<li>conversions from one standard controller to another, PCIe to SATA3 or SAS3</li>\n<li>adding external ports for SAN and DAS expansions</li>\n<li>additional physical slots in x4, x8, or x16 - just mount those style connectors in an adjacent or remote chassis zone via PCIe 1:1 extension or PCIe switch</li>\n</ul>\n<p>There are likely other examples, and I&rsquo;m always interested in finding more.</p>\n<p>#servers #baremetal #linux #freebsd #motherboard #engineering #hardware</p>\n",
				"content_text": "Staring at this board, mentally converting PCIe lane count to device requirements, only to consider that yet again... \n\nIt's 2025. We're still using the PCIe slot standard for most motherboards, even on enterprise boards. Who's doing this right, at least marginally so?\n\nASRack (brain, please grow up and stop making elementary jokes) has been putting four physical x16 slots on their \"Deep mini-ITX\" series of server boards, to which are added two x8 lane Slim-SAS and two x4 lane OcuLink headers. These can be used for a variety of SFF fan-out connection purposes. \n\nExtensions like this include: \n- multi-drive backplane headers for hot-swap 2.5\", 3.5\", U.2, U.3 bays\n- additional M.2 slots using a SFF backed PCB\n- conversions from one standard controller to another, PCIe to SATA3 or SAS3\n- adding external ports for SAN and DAS expansions\n- additional physical slots in x4, x8, or x16 - just mount those style connectors in an adjacent or remote chassis zone via PCIe 1:1 extension or PCIe switch\n\nThere are likely other examples, and I'm always interested in finding more.\n\n#servers #baremetal #linux #freebsd #motherboard #engineering #hardware\n\n",
				"date_published": "2025-06-01T08:33:19-05:00",
				"url": "https://prose.winterschon.com/2025/06/01/need-more-pcie-slots-not.html",
				"tags": ["Industry","Engineering "]
			},
			{
				"id": "http://winterschon.micro.blog/2025/05/29/womens-safety-online-why-im.html",
				"title": "Women's Safety Online: Why I'm No Longer on LinkedIn or Twitter",
				"content_html": "<p>The vast and varied subject of <em>Women&rsquo;s Safety Online</em> is a topic which impacts many facets of daily life, including emotional and physical well-being. This post is not a primer on the concepts, rather it offers a short timeline to explain why I am no longer on LinkedIn or Twitter social networks for reasons of personal safety and privacy.</p>\n<p><strong>A Tenuous Timeline</strong></p>\n<p><strong>1)</strong> Some years prior to a decade ago, I joined LinkedIn, and a small handful of years ago I joined Twitter.</p>\n<p><strong>2)</strong> Along the way a serious incident occurred, resulting in PTSD from a bodily assault; the details of which require privacy. During associated therapy a HIPAA violation occured, eroding my trust in the medical establishment.</p>\n<p><strong>3)</strong> Periodically I would receive messages on LinkedIn from recruiters at the company where that man worked. I did not want to be reminded of the events, and would never work at the same company. These external intrusions into trauma memories were not healthy and they needed to stop.</p>\n<p><strong>4)</strong> Concerns evolved which necessitated telling that company to remove me from their recruiting database and never message me ever again.</p>\n<p><strong>5)</strong> The company removed my profile, and they asked if I wanted to be involved with an investigation, which I refused for the unfortunately common reasons:</p>\n<ul>\n<li>I did not want to relive events, especially after the HIPAA issue</li>\n<li>I did not want to discuss those memories with yet another stranger</li>\n<li>I did not want to become more of a target for speaking up</li>\n</ul>\n<p>It&rsquo;s a terrible catch-22, and yet it&rsquo;s nothing new. This person needed to be prevented from ever contacting me or knowing anything about my life, requirements which the company could not ensure.</p>\n<p><strong>6)</strong> For safety reasons, I changed my legal name, then I moved, and started a new job. Then I enabled a service which monitors for identity theft issues and personal-info data leaks. Other precautions were made. The whole process is time consuming, emotionally disruptive, and fiscally burdensome.</p>\n<p><strong>7)</strong> Years pass. In the interim, LinkedIn&rsquo;s <em>&ldquo;people you might know!&quot;</em> feature will routinely recommend that I connect with people who reminded me of that trauma.</p>\n<ul>\n<li>The feature cannot be disabled and profile settings do not help. Blocking people and profiles does not sufficiently help. Their algorithm always does this.</li>\n</ul>\n<p><strong>8)</strong> Years pass. Identity theft issues become a greater risk. Someone on Twitter steals my profile, impersonating me to sell web3 tokens or whatever. I report it, and Twitter demands my government ID - which I refuse to upload.</p>\n<ul>\n<li>Preferring a human interaction, I offer to bring my ID to the Twitter office and show it to someone in person, but no - they want the digital copy to keep on file, which will totally never be leaked in a data breach.</li>\n<li>I refuse to upload the document. They lock my account. I have not bothered since.</li>\n</ul>\n<p><strong>9)</strong> Years pass. A few weeks ago, I&rsquo;m running a social media account audit and notice that LinkedIn has two unknown logins from another country - and I&rsquo;ve never been there, nor connected to an ISP or VPN or service related to that location.</p>\n<ul>\n<li>I revoke the logins, yet they reappear a week later.</li>\n<li>My account has 2FA enabled, yet the auth logs do not show it being used.</li>\n<li>Who is behind these logins? What amount of personal info and connections and messages do they have access to?</li>\n</ul>\n<p><strong>10)</strong> After seeking help from LinkedIn&rsquo;s support system, they now want my government ID, just like Twitter.</p>\n<ul>\n<li>They want a third party service (Persona) to scan it, and surely this will never be leaked (sure sure).</li>\n<li>They assure that this third party is very safe, that they only give LinkedIn redacted info (yet Persona keeps the full info?)</li>\n<li>Surely I should trust their entire system. I do not trust their system, and I will not upload my ID for it to be stolen or have any of the data used in some way to harm me.</li>\n<li>The result is similar to Twitter, my account is restricted with no access.</li>\n</ul>\n<p><strong>End Results and Oh Well&hellip;</strong></p>\n<p>So, goodbye LinkedIn, goodbye Twitter.</p>\n<p>I cannot place my trust in these faceless social media corporations, the ones which never assume responsibility for data leaks, data theft, or the sale of demographics and usage meta-data. The common refrain of, <em>&ldquo;we&rsquo;re telling you that we redacted your personal information&rdquo;</em>, means nothing substantial from these organizations.</p>\n<p>These sites profit extensively from user data - we are their product for sale, and when that happens it can lead to extremely unsafe conditions, particularly if that data can be used for location tracking, enabling access which leads to physical violence, stalking, harassment, or other detriments by which women too-often experience the online world.</p>\n<p>Sure, I could upload my ID and <em>&ldquo;just trust them&rdquo;</em>, but that would not make me safer; it would invalidate the entire purpose of protecting my body, my mind, my future. Handing them my trust, when they have routinely proven that they are not trustworthy, would render-pointless every hardship and effort towards safety and security which I&rsquo;ve been required to endure since those events so many years ago.</p>\n<p>By prioritizing my personal safety in both of these cases, the end result is that I am no longer able to engage and connect with people from my work life via the two most common business-centric social networks. The alternative is no alternative at all; <strong>choosing not to be safe is not a choice</strong>.</p>\n<p>I know what it&rsquo;s like to have my choice taken from me, and I never want that to happen again.</p>\n",
				"content_text": "The vast and varied subject of _Women's Safety Online_ is a topic which impacts many facets of daily life, including emotional and physical well-being. This post is not a primer on the concepts, rather it offers a short timeline to explain why I am no longer on LinkedIn or Twitter social networks for reasons of personal safety and privacy.\n\n**A Tenuous Timeline**\n\n**1)** Some years prior to a decade ago, I joined LinkedIn, and a small handful of years ago I joined Twitter. \n\n**2)** Along the way a serious incident occurred, resulting in PTSD from a bodily assault; the details of which require privacy. During associated therapy a HIPAA violation occured, eroding my trust in the medical establishment.\n\n**3)** Periodically I would receive messages on LinkedIn from recruiters at the company where that man worked. I did not want to be reminded of the events, and would never work at the same company. These external intrusions into trauma memories were not healthy and they needed to stop.\n\n**4)** Concerns evolved which necessitated telling that company to remove me from their recruiting database and never message me ever again. \n\n**5)** The company removed my profile, and they asked if I wanted to be involved with an investigation, which I refused for the unfortunately common reasons:\n\n- I did not want to relive events, especially after the HIPAA issue\n- I did not want to discuss those memories with yet another stranger\n- I did not want to become more of a target for speaking up\n\nIt's a terrible catch-22, and yet it's nothing new. This person needed to be prevented from ever contacting me or knowing anything about my life, requirements which the company could not ensure.\n\n**6)** For safety reasons, I changed my legal name, then I moved, and started a new job. Then I enabled a service which monitors for identity theft issues and personal-info data leaks. Other precautions were made. The whole process is time consuming, emotionally disruptive, and fiscally burdensome.\n\n**7)** Years pass. In the interim, LinkedIn's _\"people you might know!\"_ feature will routinely recommend that I connect with people who reminded me of that trauma. \n\n- The feature cannot be disabled and profile settings do not help. Blocking people and profiles does not sufficiently help. Their algorithm always does this.\n\n**8)** Years pass. Identity theft issues become a greater risk. Someone on Twitter steals my profile, impersonating me to sell web3 tokens or whatever. I report it, and Twitter demands my government ID - which I refuse to upload. \n\n- Preferring a human interaction, I offer to bring my ID to the Twitter office and show it to someone in person, but no - they want the digital copy to keep on file, which will totally never be leaked in a data breach. \n- I refuse to upload the document. They lock my account. I have not bothered since.\n\n**9)** Years pass. A few weeks ago, I'm running a social media account audit and notice that LinkedIn has two unknown logins from another country - and I've never been there, nor connected to an ISP or VPN or service related to that location. \n\n- I revoke the logins, yet they reappear a week later. \n- My account has 2FA enabled, yet the auth logs do not show it being used.\n- Who is behind these logins? What amount of personal info and connections and messages do they have access to?\n\n**10)** After seeking help from LinkedIn's support system, they now want my government ID, just like Twitter.\n\n- They want a third party service (Persona) to scan it, and surely this will never be leaked (sure sure).\n- They assure that this third party is very safe, that they only give LinkedIn redacted info (yet Persona keeps the full info?)\n- Surely I should trust their entire system. I do not trust their system, and I will not upload my ID for it to be stolen or have any of the data used in some way to harm me. \n- The result is similar to Twitter, my account is restricted with no access.\n\n**End Results and Oh Well...**\n\nSo, goodbye LinkedIn, goodbye Twitter. \n\nI cannot place my trust in these faceless social media corporations, the ones which never assume responsibility for data leaks, data theft, or the sale of demographics and usage meta-data. The common refrain of, _\"we're telling you that we redacted your personal information\"_, means nothing substantial from these organizations. \n\nThese sites profit extensively from user data - we are their product for sale, and when that happens it can lead to extremely unsafe conditions, particularly if that data can be used for location tracking, enabling access which leads to physical violence, stalking, harassment, or other detriments by which women too-often experience the online world. \n\nSure, I could upload my ID and _\"just trust them\"_, but that would not make me safer; it would invalidate the entire purpose of protecting my body, my mind, my future. Handing them my trust, when they have routinely proven that they are not trustworthy, would render-pointless every hardship and effort towards safety and security which I've been required to endure since those events so many years ago. \n\nBy prioritizing my personal safety in both of these cases, the end result is that I am no longer able to engage and connect with people from my work life via the two most common business-centric social networks. The alternative is no alternative at all; **choosing not to be safe is not a choice**. \n\nI know what it's like to have my choice taken from me, and I never want that to happen again. \n\n\n",
				"date_published": "2025-06-01T08:08:29-05:00",
				"url": "https://prose.winterschon.com/2025/05/29/womens-safety-online-why-im.html",
				"tags": ["Industry"]
			},
			{
				"id": "http://winterschon.micro.blog/2025/05/23/oh-look-fedora-crashed-again.html",
				"title": "The demise of Fedora as a Developer Distro",
				"content_html": "<p>The Q4-2024 through Q2-2025 cycle has been one of remarkable instability for Fedora kernels and systemd breaking-changes. F40 through F42 have offered more crashes, more kernel panics, and more core dumps than any triple-set of versions since its dawning into existence - and I&rsquo;ve been running this distro for dev-only boxes since the first release.</p>\n<p>In the worst of circumstances, Fedora notified me of a firmware update, which was a hands-off type of &ldquo;reboot to install&rdquo; EFI blob which bricked my Thinkpad X1 Nano laptop just last week. That&rsquo;s an expensive failure and one which has no simple resolution (many hours, many iso to img to efi/cap conversions, and maybe soon a WSOP-8 NAND reprogramming).</p>\n<p>I&rsquo;ve been all-in on the RedHat infra train since 1999, having used it at global backbone providers, satellite infra providers, hpc clusters, media conglomerates, gaming networks, streaming services, cloud providers and hyperscalers, and just about everything in-between&hellip; and while I have my qualms on certain technical aspects and corporate strategy over those years, I still consider it one of my favorite Linux distos (top five at least), and it&rsquo;s my first choice for enterprise Linux. So, I&rsquo;m not just hating on the ecosystem here, I&rsquo;m a vested user who&rsquo;s been disappointed too many times by the direction</p>\n<p>Unfortunately, with Fedora, I stand behind my position that Redhat has been too hands-off in conducting standards requirement alignment, in requiring a base level of stability upon which serious engineering development can be done, without having to clean up other people&rsquo;s messes every few weeks.</p>\n<p>It&rsquo;s just not a great dev platform distro anymore, and yet the org markets the name as if it were a valid OS for all manner of production uses. IoT use? Never, no thanks. Edge devices? Never again. Security? Forget about it.</p>\n<p>It&rsquo;s not a &ldquo;bleeding-edge issue&rdquo; - as that&rsquo;s Rawhide&rsquo;s territory where stability of any sort is not expected. The evolving issue with Fedora is that it is uncommonly unstable for a &ldquo;dev env&rdquo;, and one which ships far too much untested code and pushes the equivalent of &ldquo;crowd source fail-tests&rdquo; where they expect the users to &ldquo;just tell us if it doesn&rsquo;t work&rdquo;. Their release engineering and load-testing seems to occur with zero multivariate matrices sequences for all manner of performance, validation, and functional tests. I suppose they consider unit testing to be &ldquo;full coverage&rdquo;, but it is not. Happy to be corrected here, though I will remain disappointed and avoid any further deployments or firmware updates from Fedora.</p>\n<p>#linux #fedora #releng #engineering #software #enterprise #rhel #distros #displeasure</p>\n",
				"content_text": "The Q4-2024 through Q2-2025 cycle has been one of remarkable instability for Fedora kernels and systemd breaking-changes. F40 through F42 have offered more crashes, more kernel panics, and more core dumps than any triple-set of versions since its dawning into existence - and I've been running this distro for dev-only boxes since the first release. \n\nIn the worst of circumstances, Fedora notified me of a firmware update, which was a hands-off type of \"reboot to install\" EFI blob which bricked my Thinkpad X1 Nano laptop just last week. That's an expensive failure and one which has no simple resolution (many hours, many iso to img to efi/cap conversions, and maybe soon a WSOP-8 NAND reprogramming).\n\nI've been all-in on the RedHat infra train since 1999, having used it at global backbone providers, satellite infra providers, hpc clusters, media conglomerates, gaming networks, streaming services, cloud providers and hyperscalers, and just about everything in-between... and while I have my qualms on certain technical aspects and corporate strategy over those years, I still consider it one of my favorite Linux distos (top five at least), and it's my first choice for enterprise Linux. So, I'm not just hating on the ecosystem here, I'm a vested user who's been disappointed too many times by the direction\n\nUnfortunately, with Fedora, I stand behind my position that Redhat has been too hands-off in conducting standards requirement alignment, in requiring a base level of stability upon which serious engineering development can be done, without having to clean up other people's messes every few weeks. \n\nIt's just not a great dev platform distro anymore, and yet the org markets the name as if it were a valid OS for all manner of production uses. IoT use? Never, no thanks. Edge devices? Never again. Security? Forget about it.\n\nIt's not a \"bleeding-edge issue\" - as that's Rawhide's territory where stability of any sort is not expected. The evolving issue with Fedora is that it is uncommonly unstable for a \"dev env\", and one which ships far too much untested code and pushes the equivalent of \"crowd source fail-tests\" where they expect the users to \"just tell us if it doesn't work\". Their release engineering and load-testing seems to occur with zero multivariate matrices sequences for all manner of performance, validation, and functional tests. I suppose they consider unit testing to be \"full coverage\", but it is not. Happy to be corrected here, though I will remain disappointed and avoid any further deployments or firmware updates from Fedora.\n\n#linux #fedora #releng #engineering #software #enterprise #rhel #distros #displeasure\n",
				"date_published": "2025-05-28T17:27:48-05:00",
				"url": "https://prose.winterschon.com/2025/05/23/oh-look-fedora-crashed-again.html",
				"tags": ["Industry","Engineering ","Linux"]
			},
			{
				"id": "http://winterschon.micro.blog/2025/05/25/nvidia-ai-cluster-for-traveling.html",
				"title": "🌐 Nvidia Ai Cluster for Traveling 🌐",
				"content_html": "<p>A little travel cluster, all set for Ai engineering and development.</p>\n<ul>\n<li>1x Nvidia Jetson Xavier NX 16GB</li>\n<li>3x Nvidia Jetson Orin NX 16GB</li>\n<li>3x GoWin R86S 6005 + CX5 25G OCP 2.0</li>\n<li>Various network hardware</li>\n</ul>\n<p>Setup in a Pelican Air case, ready for the flight!</p>\n<p>#ai #engineering #development #nvidia #cluster #jetson #travel</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "A little travel cluster, all set for Ai engineering and development. \n\n- 1x Nvidia Jetson Xavier NX 16GB\n- 3x Nvidia Jetson Orin NX 16GB\n- 3x GoWin R86S 6005 + CX5 25G OCP 2.0\n- Various network hardware \n\nSetup in a Pelican Air case, ready for the flight!\n\n#ai #engineering #development #nvidia #cluster #jetson #travel\n\n\n<img src=\"https://prose.winterschon.com/uploads/2025/79fe97c7e2.png\" width=\"600\" height=\"449\" alt=\"\"><img src=\"https://prose.winterschon.com/uploads/2025/aaaf51dca4.jpg\" width=\"450\" height=\"600\" alt=\"\"><img src=\"https://prose.winterschon.com/uploads/2025/45acfb0345.jpg\" width=\"450\" height=\"600\" alt=\"\"><img src=\"https://prose.winterschon.com/uploads/2025/9d199c90f9.png\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2025-05-25T09:24:31-05:00",
				"url": "https://prose.winterschon.com/2025/05/25/nvidia-ai-cluster-for-traveling.html",
				"tags": ["Photography "]
			},
			{
				"id": "http://winterschon.micro.blog/2025/05/25/080832.html",
				"title": "🌐 Weekend Hardware Update 🌐",
				"content_html": "<p>Some additional reorganization time this weekend, all busy with the process of preparing the HomeLab for another interstate relocation. Having decided to repurpose some hardware to create a new router, this one formerly hosted infra VMs several years ago, but now it&rsquo;s going to run a pair of &ldquo;BSD Router Project&rdquo; VMs for on-host H/A, and a bit of packet shuffling between hosts for RDMA on RoCE v2, iSCSI, and a few shared NFS mounts for compute hosts, along with the usual firewall and packet filtering, some Wireguard, OpenVPN, and Zerotier, NTP + PTP via GPS/GNSS.</p>\n<p>Here&rsquo;s a quick rundown on the specs, aggregated from the parts shelves and &ldquo;it&rsquo;s not actively being used elsewhere&rdquo; collection of enterprise hardware.</p>\n<ul>\n<li>\n<p>Supermicro X11-SSM-F board</p>\n</li>\n<li>\n<p>Xeon E3-1270v6 4C/8T, 3.8/4.2GHz</p>\n</li>\n<li>\n<p>64GB ECC DDR4-2400</p>\n</li>\n<li>\n<p>2x 64GB InnoDisk SATA-DOMs</p>\n</li>\n<li>\n<p>2x 500GB MP600 NVMe gen4</p>\n</li>\n<li>\n<p>4 port QLogic QL41164 10GbE</p>\n</li>\n<li>\n<p>2 port Qnap i226 2.5GbE + 2x M.2</p>\n</li>\n<li>\n<p>4 port Intel i226 2.5GbE</p>\n</li>\n<li>\n<p>2 port Intel XL710 40GbE</p>\n</li>\n<li>\n<p><a href=\"https://www.intel.com/content/www/us/en/products/sku/97479/intel-xeon-processor-e31270-v6-8m-cache-3-80-ghz/specifications.html\">www.intel.com/content/w&hellip;</a></p>\n</li>\n<li>\n<p><a href=\"https://www.supermicro.com/en/products/motherboard/x11ssm-f\">www.supermicro.com/en/produc&hellip;</a></p>\n</li>\n<li>\n<p><a href=\"https://www.intel.com/content/www/us/en/products/sku/83967/intel-ethernet-converged-network-adapter-xl710qda2/specifications.html\">www.intel.com/content/w&hellip;</a> (AOC-S40G-I2Q)</p>\n</li>\n<li>\n<p><a href=\"https://www.marvell.com/content/dam/marvell/en/public-collateral/ethernet-adaptersandcontrollers/marvell-ethernet-adapters-fastlinq-41000-series-product-brief.pdf\">www.marvell.com/content/d&hellip;</a></p>\n</li>\n</ul>\n<p>#homelab #freebsd #router #networking #engineering #hardware #servers</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "Some additional reorganization time this weekend, all busy with the process of preparing the HomeLab for another interstate relocation. Having decided to repurpose some hardware to create a new router, this one formerly hosted infra VMs several years ago, but now it's going to run a pair of \"BSD Router Project\" VMs for on-host H/A, and a bit of packet shuffling between hosts for RDMA on RoCE v2, iSCSI, and a few shared NFS mounts for compute hosts, along with the usual firewall and packet filtering, some Wireguard, OpenVPN, and Zerotier, NTP + PTP via GPS/GNSS. \r\n\r\nHere's a quick rundown on the specs, aggregated from the parts shelves and \"it's not actively being used elsewhere\" collection of enterprise hardware.\r\n\r\n- Supermicro X11-SSM-F board\r\n- Xeon E3-1270v6 4C/8T, 3.8/4.2GHz\r\n- 64GB ECC DDR4-2400\r\n- 2x 64GB InnoDisk SATA-DOMs\r\n- 2x 500GB MP600 NVMe gen4\r\n- 4 port QLogic QL41164 10GbE\r\n- 2 port Qnap i226 2.5GbE + 2x M.2\r\n- 4 port Intel i226 2.5GbE\r\n- 2 port Intel XL710 40GbE\r\n\r\n- [www.intel.com/content/w...](https://www.intel.com/content/www/us/en/products/sku/97479/intel-xeon-processor-e31270-v6-8m-cache-3-80-ghz/specifications.html)\r\n- [www.supermicro.com/en/produc...](https://www.supermicro.com/en/products/motherboard/x11ssm-f)\r\n- [www.intel.com/content/w...](https://www.intel.com/content/www/us/en/products/sku/83967/intel-ethernet-converged-network-adapter-xl710qda2/specifications.html) (AOC-S40G-I2Q)\r\n- [www.marvell.com/content/d...](https://www.marvell.com/content/dam/marvell/en/public-collateral/ethernet-adaptersandcontrollers/marvell-ethernet-adapters-fastlinq-41000-series-product-brief.pdf)\r\n\r\n#homelab #freebsd #router #networking #engineering #hardware #servers\n\n<img src=\"https://prose.winterschon.com/uploads/2025/img-20250524-062151428-1.jpg\" width=\"438\" height=\"600\" alt=\"\"><img src=\"https://prose.winterschon.com/uploads/2025/img-20250524-063842400.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2025-05-25T08:08:32-05:00",
				"url": "https://prose.winterschon.com/2025/05/25/080832.html",
				"tags": ["Photography ","Engineering "]
			},
			{
				"id": "http://winterschon.micro.blog/2025/05/20/import-your-failures.html",
				"title": "🗑️ Import Your Failures! 🗑️",
				"content_html": "<p>While using Soundcloud the other day, prompted by a little helper fellow which states:</p>\n<blockquote>\n<p>&ldquo;Import your Spotify Playlists!&rdquo;</p>\n</blockquote>\n<p>ok, sure. I&rsquo;d like to use a single app for music if possible, and I prefer Soundcloud to Spotify in general. So, I click ok and authorize the apps' APIs to do their thing.</p>\n<p>It finishes importing. Great, back to work. Life goes on. Days later, that being five minutes ago, sitting at my desk&hellip; <em>&ldquo;time for some metal&rdquo;</em> and decide to play a near-daily favorite, <em>&ldquo;Heaven Shall Burn&rdquo;</em> compilation playlist which consists only of their music.</p>\n<p>Here&rsquo;s what Soundcloud decided to import and use for the Heaven Shall Burn playlist (attached image). Look at the artist names, the album covers, the lack of sequential existence of tracks which should all be on the same several-albums. These aren&rsquo;t even the same category of music, let alone the same band or albumns.</p>\n<p><strong>Soundcloud, you have failed.</strong> This was an easy one; you have the API calls with the correct track and author IDs right there in the Spotify playlists to do the import calls on a 1:1 basis, but no, instead you&rsquo;ve taken a giant pile of garbage and put it on my Library.</p>\n<p>Instead of <em><strong>&ldquo;Protector&rdquo; by Heaven Shall Burn</strong></em>, you give me <em>&quot;<strong>Protector&quot; by Beyonce</strong></em>. Trust me, they are not equivalent. This is garbage, more enshittification of the internet by unchecked unvalidated coding styles which prioritize <em>&ldquo;we ship code always&rdquo;</em> over <em>&ldquo;we ship when code is ready</em>&rdquo;.</p>\n<p>Now I&rsquo;m left with extra work to do, to clean up their mess of shitty playlists, and the tool imported A LOT of playlists.</p>\n<p>#music #streaming #steamingPileofSoftware #software #engineering #antipattern #trash #code #developers #enshittifcation #spotify #soundcloud #api #fail</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "While using Soundcloud the other day, prompted by a little helper fellow which states:\r\n\r\n> \"Import your Spotify Playlists!\" \r\n\r\nok, sure. I'd like to use a single app for music if possible, and I prefer Soundcloud to Spotify in general. So, I click ok and authorize the apps' APIs to do their thing. \r\n\r\nIt finishes importing. Great, back to work. Life goes on. Days later, that being five minutes ago, sitting at my desk... _\"time for some metal\"_ and decide to play a near-daily favorite, _\"Heaven Shall Burn\"_ compilation playlist which consists only of their music.\r\n\r\nHere's what Soundcloud decided to import and use for the Heaven Shall Burn playlist (attached image). Look at the artist names, the album covers, the lack of sequential existence of tracks which should all be on the same several-albums. These aren't even the same category of music, let alone the same band or albumns.\r\n\r\n**Soundcloud, you have failed.** This was an easy one; you have the API calls with the correct track and author IDs right there in the Spotify playlists to do the import calls on a 1:1 basis, but no, instead you've taken a giant pile of garbage and put it on my Library.\r\n\r\nInstead of _**\"Protector\" by Heaven Shall Burn**_, you give me _\"**Protector\" by Beyonce**_. Trust me, they are not equivalent. This is garbage, more enshittification of the internet by unchecked unvalidated coding styles which prioritize _\"we ship code always\"_ over _\"we ship when code is ready_\". \r\n\r\nNow I'm left with extra work to do, to clean up their mess of shitty playlists, and the tool imported A LOT of playlists. \r\n\r\n#music #streaming #steamingPileofSoftware #software #engineering #antipattern #trash #code #developers #enshittifcation #spotify #soundcloud #api #fail \n\n<img src=\"https://prose.winterschon.com/uploads/2025/soundcloud-import-spotify-playlists-20250520-053747.png\" width=\"600\" height=\"343\" alt=\"\">\n",
				"date_published": "2025-05-20T06:03:49-05:00",
				"url": "https://prose.winterschon.com/2025/05/20/import-your-failures.html",
				"tags": ["Photography ","Engineering "]
			},
			{
				"id": "http://winterschon.micro.blog/2025/05/19/memories-of-harmonic-distortion-descending.html",
				"title": "Memories of Harmonic Distortion, Descending Carson Pass",
				"content_html": "<p>While training for The Death Ride one year, so many years ago, I had quite a surprise on Highway 88 while descending Carson Pass in the Sierra Nevada. This was in the late season, the last week of October, a last minute plan with a best friend to get one last ride in before the snow storms arrived. On top of the usual physical challenges of climbing ~2,500' vertical up to 8,575 elevation, it was uncommonly cold.</p>\n<p>For the background, I loved endurance racing, and the many long, standing (not seated) hill climbs and mountain passes always were my favorite. Climbing the front-side and then heading down the back-sides of big mountain passes in the Sierra Nevada at 50+mph (80kph) was however not my favorite - but a good lesson in reaping what you sow. Thankfully I never crashed on those, despite having climbed all of the majors and several lesser traveled, many times over: Monitor, Ebbetts, Carson, Echo, Rose, Yuba, Donner, Tioga, Brockway, Daggett, Luther, Pacific Grade Summit, and famously adjacent Geiger Grade going to Virginia City (a common morning ride before work). All of my crashes were on mountain and cyclo-cross, so I was certainly not immune.</p>\n<p>The closest I came to a high speed get-off was on Carson Pass (highway 88), back in 2001. I was riding a new set of criterium race wheels that were ultra-lightweight, perfect for climbing up the pass to the summit, but during the descent speed-wobbles had set-in around the 45mph point and continued through to 54mph, starting directly after the first major right-hand curve.</p>\n<p>While arc&rsquo;ing the bike inside the turn, standard approach to manage centrifugal force, and then leaning it back upright as the road straightened, harmonic distortion set in, rippling faster and faster through the bike&rsquo;s frame, up into my body, blurring my vision. Sometimes going faster will sort out the wave, but not this time, and by 50mph the flexing nearly tore the wheels apart from a combination of light-weight hubs and spokes/rims not having sufficient torsional strength to sustain the pressure involved with the induced coefficient-of-friction and centrifugal force.</p>\n<p>This was the kind of turn with speed, which one can see racers engage with on the Tour, which require a rear-side body-torque movement to snap/push the frame out of its desire to continue through the curve and resume going straight - too much downward force started to turn the wheel into an slight oval. This same body movement is used in MotoGP and motocross racing, as it&rsquo;s an essential skill for powering through a curve while pushing physical limits. The feeling was like that of an al-dente noodle, if one were to imagine being thrown down a hill while trying to keep everything straight and rigid - just stiff enough to not immediately die, but very close to dying really quickly. Wearing a helmet in that case wouldn&rsquo;t have saved my life, as the pass is surrounded by granite walls and boulders and steep drops.</p>\n<p>It took an entire mile of deceleration, achieved through pulsing the front and rear brakes at a 30/70% ratio (like anti-lock brakes on a car, but without the computer), to safely slow down enough for the distortion to resolve. If you don&rsquo;t pulse the brakes then the pads can overheat and melt, contributing far worse conditions into the mix. By the ~30mph point I had recovered enough control over the bike to gently guide us to a turnout several miles down the pass and then dismount. A lot of adrenaline that day, the intensity of focus and attention to the senses required was certainly a high-point at my youngish age (early 20s).</p>\n<p>My friend, a far better racer than I&rsquo;d ever become, could only laugh at the scene. It wasn&rsquo;t either of our first experiences with harmonic distortion, and what else is there to do but laugh and get back on the bike? Away we went, continuing down the steep but fast and straight-smooth road to Woodfords where we parked the car.</p>\n<p>Well anyway, I had those wheels relaced with bladed titanium spokes and hardened steel nipples tensioned with a digital torque meter (not &ldquo;feeling the torque by hand&rdquo;), and never used them for hill climbs ever again.</p>\n<p>As for The Death Ride, they no longer include Highway 88&rsquo;s Carson Pass on the route, mostly due to safety.</p>\n<p>References</p>\n<ul>\n<li>Beautiful photos and a grade map: <a href=\"https://www.tourofcalifornia.org/2006/07/death-ride.html\">www.tourofcalifornia.org/2006/07/d&hellip;</a></li>\n<li>Stats on the pass: <a href=\"https://en.wikipedia.org/wiki/Carson_Pass\">en.wikipedia.org/wiki/Cars&hellip;</a></li>\n<li>The perfect yearly event: <a href=\"https://deathride.com\">deathride.com</a></li>\n<li>Mentions about Carson no longer being used: <a href=\"https://deathride.com\">deathride.com</a>/faq/</li>\n</ul>\n<p>#cycling #memories #theDeathRide #training #endurance</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "While training for The Death Ride one year, so many years ago, I had quite a surprise on Highway 88 while descending Carson Pass in the Sierra Nevada. This was in the late season, the last week of October, a last minute plan with a best friend to get one last ride in before the snow storms arrived. On top of the usual physical challenges of climbing ~2,500' vertical up to 8,575 elevation, it was uncommonly cold. \r\n\r\nFor the background, I loved endurance racing, and the many long, standing (not seated) hill climbs and mountain passes always were my favorite. Climbing the front-side and then heading down the back-sides of big mountain passes in the Sierra Nevada at 50+mph (80kph) was however not my favorite - but a good lesson in reaping what you sow. Thankfully I never crashed on those, despite having climbed all of the majors and several lesser traveled, many times over: Monitor, Ebbetts, Carson, Echo, Rose, Yuba, Donner, Tioga, Brockway, Daggett, Luther, Pacific Grade Summit, and famously adjacent Geiger Grade going to Virginia City (a common morning ride before work). All of my crashes were on mountain and cyclo-cross, so I was certainly not immune. \r\n\r\nThe closest I came to a high speed get-off was on Carson Pass (highway 88), back in 2001. I was riding a new set of criterium race wheels that were ultra-lightweight, perfect for climbing up the pass to the summit, but during the descent speed-wobbles had set-in around the 45mph point and continued through to 54mph, starting directly after the first major right-hand curve. \r\n\r\nWhile arc'ing the bike inside the turn, standard approach to manage centrifugal force, and then leaning it back upright as the road straightened, harmonic distortion set in, rippling faster and faster through the bike's frame, up into my body, blurring my vision. Sometimes going faster will sort out the wave, but not this time, and by 50mph the flexing nearly tore the wheels apart from a combination of light-weight hubs and spokes/rims not having sufficient torsional strength to sustain the pressure involved with the induced coefficient-of-friction and centrifugal force.\r\n\r\nThis was the kind of turn with speed, which one can see racers engage with on the Tour, which require a rear-side body-torque movement to snap/push the frame out of its desire to continue through the curve and resume going straight - too much downward force started to turn the wheel into an slight oval. This same body movement is used in MotoGP and motocross racing, as it's an essential skill for powering through a curve while pushing physical limits. The feeling was like that of an al-dente noodle, if one were to imagine being thrown down a hill while trying to keep everything straight and rigid - just stiff enough to not immediately die, but very close to dying really quickly. Wearing a helmet in that case wouldn't have saved my life, as the pass is surrounded by granite walls and boulders and steep drops.\r\n\r\nIt took an entire mile of deceleration, achieved through pulsing the front and rear brakes at a 30/70% ratio (like anti-lock brakes on a car, but without the computer), to safely slow down enough for the distortion to resolve. If you don't pulse the brakes then the pads can overheat and melt, contributing far worse conditions into the mix. By the ~30mph point I had recovered enough control over the bike to gently guide us to a turnout several miles down the pass and then dismount. A lot of adrenaline that day, the intensity of focus and attention to the senses required was certainly a high-point at my youngish age (early 20s). \r\n\r\nMy friend, a far better racer than I'd ever become, could only laugh at the scene. It wasn't either of our first experiences with harmonic distortion, and what else is there to do but laugh and get back on the bike? Away we went, continuing down the steep but fast and straight-smooth road to Woodfords where we parked the car. \r\n\r\nWell anyway, I had those wheels relaced with bladed titanium spokes and hardened steel nipples tensioned with a digital torque meter (not \"feeling the torque by hand\"), and never used them for hill climbs ever again.\r\n\r\nAs for The Death Ride, they no longer include Highway 88's Carson Pass on the route, mostly due to safety. \r\n\r\nReferences\r\n- Beautiful photos and a grade map: [www.tourofcalifornia.org/2006/07/d...](https://www.tourofcalifornia.org/2006/07/death-ride.html)\r\n- Stats on the pass: [en.wikipedia.org/wiki/Cars...](https://en.wikipedia.org/wiki/Carson_Pass)\r\n- The perfect yearly event: [deathride.com](https://deathride.com)\r\n- Mentions about Carson no longer being used: [deathride.com](https://deathride.com)/faq/\r\n\r\n#cycling #memories #theDeathRide #training #endurance\n\n<img src=\"https://prose.winterschon.com/uploads/2025/24-percent-grade.jpg\" width=\"450\" height=\"600\" alt=\"\"><img src=\"https://prose.winterschon.com/uploads/2025/scrn-cap.2025-0519-0700-20.jpg\" width=\"600\" height=\"463\" alt=\"\"><img src=\"https://prose.winterschon.com/uploads/2025/death-ride-profile.png\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2025-05-19T07:05:28-05:00",
				"url": "https://prose.winterschon.com/2025/05/19/memories-of-harmonic-distortion-descending.html",
				"tags": ["Musings","Emotive","Photography "]
			},
			{
				"id": "http://winterschon.micro.blog/2025/05/14/mozilla-thunderbird-the-failure-of.html",
				"title": "💻 Mozilla Thunderbird - The Failure of a Once Great Client 💻",
				"content_html": "<p>Thunderbird, wtf are you doing where you need 83% CPU plus ~50GB (virt) and 20G (res) of RAM allocated?</p>\n<p>The entire mailbox isn&rsquo;t even 1GB in total size. Yet here it is, cranking out all of this nebulous processing 24/7&hellip; literally 24/7 it&rsquo;s running loads like this for months now. Generally I ignore it because the workstation has a modern EPYC with 32 cores and 128GB of RAM, so it&rsquo;s not completely crippling my usage&hellip; but sometimes it does, and sometimes I want that 50/20GB split to not be around, and I want those clock cycles and L1/L2 cache doing something useful.</p>\n<p>This issue has persisted over several major versions, it&rsquo;s not a new issue. I&rsquo;ve gone through all of the usual steps, removing all themes and plugins, etc. Nothing fixes the problem, and there&rsquo;s nothing useful in its logs. Uninstall and reinstall, use on different computers, use with different server settings, use on different domain accounts, it doesn&rsquo;t matter&hellip; Thunderbird always runs itself into failure mode eventually.</p>\n<p>I don&rsquo;t want to dtrace it, I don&rsquo;t want to strace it, I don&rsquo;t want to deal with this at all because email is not complicated enough to warrant such investment of my engineering time or focus.</p>\n<p>I hate what Thunderbird has become, and I&rsquo;ve been using it since version 1.0 way back in the 2000s. I&rsquo;ve used it on all of the operating systems upon which it&rsquo;s been supported. This has become absurd, the slow death of a once great product.</p>\n<p>You&rsquo;re an email client. You handle IMAP. This resource usage is unacceptable.</p>\n<p>#opensource #mozilla #thunderbird #email #slow #debugging #programming #linux #freebsd #desktop</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Thunderbird, wtf are you doing where you need 83% CPU plus ~50GB (virt) and 20G (res) of RAM allocated? \r\n\r\nThe entire mailbox isn't even 1GB in total size. Yet here it is, cranking out all of this nebulous processing 24/7... literally 24/7 it's running loads like this for months now. Generally I ignore it because the workstation has a modern EPYC with 32 cores and 128GB of RAM, so it's not completely crippling my usage... but sometimes it does, and sometimes I want that 50/20GB split to not be around, and I want those clock cycles and L1/L2 cache doing something useful.\r\n\r\nThis issue has persisted over several major versions, it's not a new issue. I've gone through all of the usual steps, removing all themes and plugins, etc. Nothing fixes the problem, and there's nothing useful in its logs. Uninstall and reinstall, use on different computers, use with different server settings, use on different domain accounts, it doesn't matter... Thunderbird always runs itself into failure mode eventually. \r\n\r\nI don't want to dtrace it, I don't want to strace it, I don't want to deal with this at all because email is not complicated enough to warrant such investment of my engineering time or focus.\r\n\r\nI hate what Thunderbird has become, and I've been using it since version 1.0 way back in the 2000s. I've used it on all of the operating systems upon which it's been supported. This has become absurd, the slow death of a once great product.\r\n\r\nYou're an email client. You handle IMAP. This resource usage is unacceptable.\r\n\r\n#opensource #mozilla #thunderbird #email #slow #debugging #programming #linux #freebsd #desktop \n\n<img src=\"https://prose.winterschon.com/uploads/2025/thunderbird-wtf-2025-0514-0735.png\" width=\"600\" height=\"260\" alt=\"\">\n",
				"date_published": "2025-05-14T07:55:41-05:00",
				"url": "https://prose.winterschon.com/2025/05/14/mozilla-thunderbird-the-failure-of.html",
				"tags": ["Musings","Photography ","Engineering "]
			},
			{
				"id": "http://winterschon.micro.blog/2025/05/13/am-dev-box-gpu-rdma.html",
				"title": "4am Dev Box - GPU \u0026 RDMA Hardware Shuffle",
				"content_html": "<p>Some photos from a bit of 4am dev box maintenance earlier this morning, focused on hardware reallocation and consolidation to maximize PCIe lane utilization.</p>\n<p>This box will host one VM using full PCIe passthrough on the GPUs and 50% NPAR for the NIC ports, and four smaller VMs. Storage for the VMs will be host-level ZFS on the two P3608, split up as several zvol allocated to the smaller VMs for a RoCE-v2 storage micro-cluster, replication to off-host network based storage also using RDMA.</p>\n<p>The GPU compute VM will be running our agentic-consensus LLM models, continuing development into deeper waters prior to running on the bigger hosts in colocation.</p>\n<ul>\n<li>4x Ampere A4000 GPUs</li>\n<li>2x 4TB Optane P3608 NVMe (2x 2TB per card)</li>\n<li>4x 128GB (512GB) Optane NVDIMMs + volatile 128GB of RDIMMs</li>\n<li>64 Thread Xeon 8370C, 2.8Ghz (Hyperscaler SKU)</li>\n<li>4-port 25GbE QLogic NIC, QL41234, using RoCE v2 RDMA</li>\n</ul>\n<p>#nvidia #gpu #ai #engineering #llm #development</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "Some photos from a bit of 4am dev box maintenance earlier this morning, focused on hardware reallocation and consolidation to maximize PCIe lane utilization.\n\nThis box will host one VM using full PCIe passthrough on the GPUs and 50% NPAR for the NIC ports, and four smaller VMs. Storage for the VMs will be host-level ZFS on the two P3608, split up as several zvol allocated to the smaller VMs for a RoCE-v2 storage micro-cluster, replication to off-host network based storage also using RDMA.\n\nThe GPU compute VM will be running our agentic-consensus LLM models, continuing development into deeper waters prior to running on the bigger hosts in colocation.\n\n- 4x Ampere A4000 GPUs\n- 2x 4TB Optane P3608 NVMe (2x 2TB per card)\n- 4x 128GB (512GB) Optane NVDIMMs + volatile 128GB of RDIMMs\n- 64 Thread Xeon 8370C, 2.8Ghz (Hyperscaler SKU)\n- 4-port 25GbE QLogic NIC, QL41234, using RoCE v2 RDMA\n\n#nvidia #gpu #ai #engineering #llm #development\n\n<img src=\"https://prose.winterschon.com/uploads/2025/e8a5d08627.png\" width=\"600\" height=\"529\" alt=\"\"><img src=\"https://prose.winterschon.com/uploads/2025/113c611f49.png\" width=\"460\" height=\"600\" alt=\"\"><img src=\"https://prose.winterschon.com/uploads/2025/1b5fbcb6e0.png\" width=\"600\" height=\"435\" alt=\"\">\n",
				"date_published": "2025-05-13T23:13:15-05:00",
				"url": "https://prose.winterschon.com/2025/05/13/am-dev-box-gpu-rdma.html",
				"tags": ["Photography "]
			},
			{
				"id": "http://winterschon.micro.blog/2025/05/11/the-noncontroversial-controversy-of-btrfs.html",
				"title": "The non-Controversial Controversy of BTRFS ",
				"content_html": "<p>Some clarifications on some points here about the history of BTRFS as it relates to Oracle, Sun Microsystems, RedHat, ZFS, and a DARPA funded filesystem research project which concluded with a ghastly murder.</p>\n<blockquote>\n<p>Oracle bought Sun to get the ZFS file system. They have been porting ZFS features into Btrfs. The head of the Ext4 file system project, an Oracle employee, said that Ext4 was just a temporary stepping stone on the way to Btrfs.</p>\n</blockquote>\n<ol>\n<li>\n<p>A primary motivation for Oracle&rsquo;s acquisition of Sun was to obtain and control the IP for the MySQL database project, which had been obliterating a large amount of Oracle DB customer licensing and dominating the OSS database landscape.</p>\n</li>\n<li>\n<p>A primary motivation for Oracle&rsquo;s acquisition of Sun was to obtain their hardware platform for running Oracle DB, Oracle J2EE applications, and their vast middleware stacks. This was everything related to the UltraSparc architecture, Sun Fire line of Opteron based servers, all of the high performance storage technology, and all of Sun&rsquo;s enterprise contracts with the US military, US gov, various nation states, and all manner of other high-end &ldquo;serious business&rdquo; service compute providers.</p>\n</li>\n<li>\n<p>Sun created Java, nearly all of Oracle&rsquo;s entire stack requires Java, and Larry wanted that as a foundational piece of IP. At the time of the acquisition, the world ran on Java and it was the most profitable and most widely deployed programming language as well as server runtime environment (JDK, JRE). This aspect is also related to various IP lawsuits around Java, see Oracle vs Google later on.</p>\n</li>\n<li>\n<p>ReiserFS features were ported into Btrfs, not ZFS features. ZFS has always dominated enterprise storage, never btrfs, never ReiserFS. ZFS in an entirely different class of quality, performance, scalability, reliability, and global market penetration.</p>\n</li>\n<li>\n<p>RedHat was tired of supporting Btrfs after too many customers reported critical data-loss incidents, which could only serve to harm the company&rsquo;s reputation for stability and technical excellence.</p>\n</li>\n<li>\n<p>ZFS continues to be amazing, Btrfs continues to suck, Oracle still has their own original ZFS source tree separate from the OpenZFS project, Oracle still sells UltraSparc architecture, Oracle still owns Java IP, Oracle still doesn&rsquo;t prioritize Btrfs, nothing important runs on Btrfs.</p>\n</li>\n</ol>\n<p>The only recent news about btrfs and Redhat, which invalidates the original claims about Redhat vs Oracle conspiracy, is that Fedora Linux 33 has Btrfs as a default option along with XFS and Ext4, and we all know that Fedora is upstream development for RedHat Enterprise Linux.</p>\n<p>Some timeline details:</p>\n<ul>\n<li>2007, Btrfs concepts and originated at IBM</li>\n<li>2008, rip-off of ReiserFS features started by developer at Oracle, who was a former dev of ReiserFS (before Hans Reiser murdered wife, tried to cover it up, landed in prison, and ReiserFS project basically died too)</li>\n<li>Btrfs continues to be experimental for years, cannot complete with ZFS on any important metrics</li>\n<li>2008, Oracle Exadata v1 - a specialized hardware platform for running Oracle databases on HP-UX with Itanium procs</li>\n<li>2009, Oracle Exadata v2 - now running on Sun hardware, using modified Sun Fire systems with AMD Opteron procs</li>\n<li>2010, Oracle acquired Sun which had recently acquired MySQL</li>\n<li>2011, Redhat offers Btrfs as experimental in RHEL 6 beta</li>\n<li>2012, Btrfs main developer leaves Oracle for Fusion-IO</li>\n<li>2012, Oracle and SUSE offer Btrfs in their distro for prod use</li>\n<li>2013, Btrfs main developer leaves Fusion-IO for Facebook</li>\n<li>2017, Redhat removes Btrfs from inclusion to RHEL 8, switching to XFS (originally from SGI)</li>\n<li>2018, Redhat acquisition by IBM</li>\n</ul>\n<p>Some enjoyable references:</p>\n<ul>\n<li><a href=\"https://en.wikipedia.org/wiki/Btrfs\">en.wikipedia.org/wiki/Btrf&hellip;</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/Acquisition_of_Sun_Microsystems_by_Oracle_Corporation\">en.wikipedia.org/wiki/Acqu&hellip;</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/Hans_Reiser\">en.wikipedia.org/wiki/Hans&hellip;</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/ZFS\">en.wikipedia.org/wiki/ZFS</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/XFS\">en.wikipedia.org/wiki/XFS</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/Oracle_Database#Competition\">en.wikipedia.org/wiki/Orac&hellip;</a></li>\n<li><a href=\"https://www.oracle.com/webfolder/s/assets/infographics/10-years-of-exadata/index.html\">www.oracle.com/webfolder&hellip;</a></li>\n<li><a href=\"https://flashdba.com/history-of-exadata/\">flashdba.com/history-o&hellip;</a></li>\n</ul>\n<p>#linux #btrfs #zfs #oracle #tech #history #redhat #sunmicrosystems</p>\n",
				"content_text": "Some clarifications on some points here about the history of BTRFS as it relates to Oracle, Sun Microsystems, RedHat, ZFS, and a DARPA funded filesystem research project which concluded with a ghastly murder.\n\n> Oracle bought Sun to get the ZFS file system. They have been porting ZFS features into Btrfs. The head of the Ext4 file system project, an Oracle employee, said that Ext4 was just a temporary stepping stone on the way to Btrfs.\n\n1. A primary motivation for Oracle's acquisition of Sun was to obtain and control the IP for the MySQL database project, which had been obliterating a large amount of Oracle DB customer licensing and dominating the OSS database landscape.\n\n2. A primary motivation for Oracle's acquisition of Sun was to obtain their hardware platform for running Oracle DB, Oracle J2EE applications, and their vast middleware stacks. This was everything related to the UltraSparc architecture, Sun Fire line of Opteron based servers, all of the high performance storage technology, and all of Sun's enterprise contracts with the US military, US gov, various nation states, and all manner of other high-end \"serious business\" service compute providers.\n\n3. Sun created Java, nearly all of Oracle's entire stack requires Java, and Larry wanted that as a foundational piece of IP. At the time of the acquisition, the world ran on Java and it was the most profitable and most widely deployed programming language as well as server runtime environment (JDK, JRE). This aspect is also related to various IP lawsuits around Java, see Oracle vs Google later on.\n\n4. ReiserFS features were ported into Btrfs, not ZFS features. ZFS has always dominated enterprise storage, never btrfs, never ReiserFS. ZFS in an entirely different class of quality, performance, scalability, reliability, and global market penetration.\n\n5. RedHat was tired of supporting Btrfs after too many customers reported critical data-loss incidents, which could only serve to harm the company's reputation for stability and technical excellence. \n\n6. ZFS continues to be amazing, Btrfs continues to suck, Oracle still has their own original ZFS source tree separate from the OpenZFS project, Oracle still sells UltraSparc architecture, Oracle still owns Java IP, Oracle still doesn't prioritize Btrfs, nothing important runs on Btrfs.\n\nThe only recent news about btrfs and Redhat, which invalidates the original claims about Redhat vs Oracle conspiracy, is that Fedora Linux 33 has Btrfs as a default option along with XFS and Ext4, and we all know that Fedora is upstream development for RedHat Enterprise Linux.\n\nSome timeline details: \n\n- 2007, Btrfs concepts and originated at IBM\n- 2008, rip-off of ReiserFS features started by developer at Oracle, who was a former dev of ReiserFS (before Hans Reiser murdered wife, tried to cover it up, landed in prison, and ReiserFS project basically died too)\n- Btrfs continues to be experimental for years, cannot complete with ZFS on any important metrics \n- 2008, Oracle Exadata v1 - a specialized hardware platform for running Oracle databases on HP-UX with Itanium procs\n- 2009, Oracle Exadata v2 - now running on Sun hardware, using modified Sun Fire systems with AMD Opteron procs\n- 2010, Oracle acquired Sun which had recently acquired MySQL\n- 2011, Redhat offers Btrfs as experimental in RHEL 6 beta\n- 2012, Btrfs main developer leaves Oracle for Fusion-IO\n- 2012, Oracle and SUSE offer Btrfs in their distro for prod use\n- 2013, Btrfs main developer leaves Fusion-IO for Facebook \n- 2017, Redhat removes Btrfs from inclusion to RHEL 8, switching to XFS (originally from SGI)\n- 2018, Redhat acquisition by IBM\n\nSome enjoyable references:\n\n- [en.wikipedia.org/wiki/Btrf...](https://en.wikipedia.org/wiki/Btrfs)\n- [en.wikipedia.org/wiki/Acqu...](https://en.wikipedia.org/wiki/Acquisition_of_Sun_Microsystems_by_Oracle_Corporation)\n- [en.wikipedia.org/wiki/Hans...](https://en.wikipedia.org/wiki/Hans_Reiser)\n- [en.wikipedia.org/wiki/ZFS](https://en.wikipedia.org/wiki/ZFS)\n- [en.wikipedia.org/wiki/XFS](https://en.wikipedia.org/wiki/XFS)\n- [en.wikipedia.org/wiki/Orac...](https://en.wikipedia.org/wiki/Oracle_Database#Competition)\n- [www.oracle.com/webfolder...](https://www.oracle.com/webfolder/s/assets/infographics/10-years-of-exadata/index.html)\n- [flashdba.com/history-o...](https://flashdba.com/history-of-exadata/)\n\n#linux #btrfs #zfs #oracle #tech #history #redhat #sunmicrosystems  \n",
				"date_published": "2025-05-11T08:34:10-05:00",
				"url": "https://prose.winterschon.com/2025/05/11/the-noncontroversial-controversy-of-btrfs.html"
			},
			{
				"id": "http://winterschon.micro.blog/2025/04/24/updates-on-remote-access-to.html",
				"title": "💾 Updates on Remote Access to POWER9 💾",
				"content_html": "<p>Some quick progress notes for a few FreeBSD and OpenZFS devs, which will be accessing one of my POWER9 systems.</p>\n<p>See photos for visual reference.</p>\n<ul>\n<li>Separate L1 and L2 domain for all network access, zero-shared DMZ, unconnected to the rest of the RFC99 lab lack</li>\n<li>Mikrotik router has been temporarily slapped into place on the side of my lab rack, directly in back of the Talos II system (dual socket, 144 threads of fun!), using PoE for the main link</li>\n<li>PiKVM v3 is being cabled up for a jump box, will connect to the Mikrotik switch ports</li>\n<li>Talos II&rsquo;s OpenBMC will be connected to the Mikrotik switch ports, offering iKVM and ipmitool SoL terminal, which will be accessible via the jumpbox</li>\n<li>Wireguard tunnels will be allocated on the Mikrotik router for remote users</li>\n<li>APC PDU for remote power cycling (hard reboot style) of the Talos II is accessible via SNMP v3 authenticated command</li>\n</ul>\n<p>Later today on the &ldquo;Bhyve Production Users&rdquo; meeting, I&rsquo;ll go over those notes.</p>\n<ul>\n<li>Thursdays at 10am PST</li>\n<li>Recordings:  <a href=\"https://www.youtube.com/@callfortesting\">www.youtube.com/@callfort&hellip;</a></li>\n<li>More info: <a href=\"https://callfortesting.org\">callfortesting.org</a></li>\n</ul>\n<p><a href=\"https://micro.blog/dexter@bsd.network\">@dexter@bsd.network</a></p>\n<p>#freebsd #openzfs #power9 #engineering #opensource #networking #linux</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "Some quick progress notes for a few FreeBSD and OpenZFS devs, which will be accessing one of my POWER9 systems. \n\nSee photos for visual reference.\n\n- Separate L1 and L2 domain for all network access, zero-shared DMZ, unconnected to the rest of the RFC99 lab lack\n- Mikrotik router has been temporarily slapped into place on the side of my lab rack, directly in back of the Talos II system (dual socket, 144 threads of fun!), using PoE for the main link\n- PiKVM v3 is being cabled up for a jump box, will connect to the Mikrotik switch ports \n- Talos II's OpenBMC will be connected to the Mikrotik switch ports, offering iKVM and ipmitool SoL terminal, which will be accessible via the jumpbox\n- Wireguard tunnels will be allocated on the Mikrotik router for remote users\n- APC PDU for remote power cycling (hard reboot style) of the Talos II is accessible via SNMP v3 authenticated command \n\nLater today on the \"Bhyve Production Users\" meeting, I'll go over those notes. \n\n- Thursdays at 10am PST\n- Recordings:  [www.youtube.com/@callfort...](https://www.youtube.com/@callfortesting)\n- More info: [callfortesting.org](https://callfortesting.org)\n\n[@dexter@bsd.network](https://micro.blog/dexter@bsd.network)\n\n#freebsd #openzfs #power9 #engineering #opensource #networking #linux\n\n<img src=\"https://prose.winterschon.com/uploads/2025/cd1407b366.png\" width=\"600\" height=\"450\" alt=\"\"><img src=\"https://prose.winterschon.com/uploads/2025/7b381d59b3.jpg\" width=\"462\" height=\"600\" alt=\"\">\n",
				"date_published": "2025-04-24T10:39:38-05:00",
				"url": "https://prose.winterschon.com/2025/04/24/updates-on-remote-access-to.html",
				"tags": ["Industry","Photography ","Engineering "]
			},
			{
				"id": "http://winterschon.micro.blog/2025/04/21/linux-kollektivs-oh-please.html",
				"title": "⚒️ Linux Kollektivs - Oh Please ⚒️",
				"content_html": "<p>I love a lot about the linux world, and there&rsquo;s a lot of positive aspects to the kernel itself, which has brought a lot of joy over the years, with kernel module development, debugging, tuning, analyzing&hellip; specifically for my career, but also on a personal level. For one quarter of a century I&rsquo;ve been using Linux and BSDs in many different flavors, but there&rsquo;s an accelerating trend in the corporatized linux space which has been quite concerning.</p>\n<p>The marketing trends used by The Big Names over the past decade remind me far too much of Cold War propaganda, of the lies from literal communists which stained mine and many other&rsquo;s youthful years. Those lies fell apart in 1989 and we all hoped that would be the end of it&hellip; but of course not.</p>\n<p>The Perception</p>\n<blockquote>\n<p>Das Kollektiv der Gemeinschaft!\nWir sind für Sie da!\nSchließt euch den Reihen des Proletariats an und vernichtet den Menschen!</p>\n</blockquote>\n<p>Translated, loosely</p>\n<blockquote>\n<p>The collective of the community!\nWe are here for you!\nJoin the ranks of the proletariat and destroy the Man!</p>\n</blockquote>\n<p>I do not want your communism.\nI do not want your pseudo-cooperatives.\nI do not want your kollektiv of anything.</p>\n<p>We&rsquo;ve had our community this whole time, and the corporate influence was supposed to be secondary. We had to fight and push to get OSS into the corporate sphere for decades, and sure enough, people take that for granted.</p>\n<p>There used to be an alignment where OSS was to &ldquo;be against the corporate overloads of closed-source&rdquo;, about &ldquo;freedom of choice and implementation&rdquo;, about &ldquo;fair use licenses&rdquo;. This was in opposition to Microsoft, Oracle, ATT unix, SCO unix, etc. But we all know what happened. The big names bought their way in, pumped up all the money making schemes, and now we see this trite marketing where billion dollar companies get to role play like they care about the communities which WE built over the past three+ decades.</p>\n<p>Don&rsquo;t believe me? Go look at the recent Fedora website redesign. Look at Canonical. There are many examples and one can find them easily by perusing the Distro-Watch list of a 100+ remakes.</p>\n<p>I&rsquo;m in no way against corporate interest and benefit when it&rsquo;s ethical, when it&rsquo;s up-front and honest about its intentions. Though they are not my favorites of the world, at least Redhat and Oracle don&rsquo;t try to pull one over on the user with their main sites &ndash; it&rsquo;s obvious that they are there for corporate players and for profitability, which is fine. I&rsquo;ve paid for their licenses, for their hardware, many times in many ways, from personal use to license structures while operating a startup, so I&rsquo;m not anti-corporation in the overall sense.</p>\n<p>However, this approach to &ldquo;we&rsquo;re all in this together&rdquo; fake messaging is tiresome. The irony of Fedora being owned by Redhat, who is owned by IBM; draw whatever conclusions one wants there, but they are all managed by different sectors.</p>\n<p>So then, do we really need to be sold on the community aspect of what is inherently a community of developers working together for a shared goal? No, we do not, those are supposed to be intrisic and inherent qualities without need of mention.</p>\n<p>Who does it better? Here&rsquo;s a non-exhaustive short list from the top of my mind.</p>\n<ul>\n<li>Gentoo (<a href=\"https://www.gentoo.org\">https://www.gentoo.org</a>)</li>\n<li>Chimera (<a href=\"https://chimera-linux.org\">https://chimera-linux.org</a>)</li>\n<li>SUSE (<a href=\"https://www.suse.com\">https://www.suse.com</a>)</li>\n<li>Void (<a href=\"https://voidlinux.org\">https://voidlinux.org</a>)</li>\n</ul>\n<p>Don&rsquo;t get me going on the BSDs&hellip; they are perfect and I love them, so it&rsquo;s a totally different conversation. 💗</p>\n",
				"content_text": "I love a lot about the linux world, and there's a lot of positive aspects to the kernel itself, which has brought a lot of joy over the years, with kernel module development, debugging, tuning, analyzing... specifically for my career, but also on a personal level. For one quarter of a century I've been using Linux and BSDs in many different flavors, but there's an accelerating trend in the corporatized linux space which has been quite concerning.\n\nThe marketing trends used by The Big Names over the past decade remind me far too much of Cold War propaganda, of the lies from literal communists which stained mine and many other's youthful years. Those lies fell apart in 1989 and we all hoped that would be the end of it... but of course not.\n\nThe Perception\n> Das Kollektiv der Gemeinschaft!\n> Wir sind für Sie da! \n> Schließt euch den Reihen des Proletariats an und vernichtet den Menschen!\n\nTranslated, loosely\n> The collective of the community!\n> We are here for you!\n> Join the ranks of the proletariat and destroy the Man!\n\nI do not want your communism.\nI do not want your pseudo-cooperatives.\nI do not want your kollektiv of anything.\n\nWe've had our community this whole time, and the corporate influence was supposed to be secondary. We had to fight and push to get OSS into the corporate sphere for decades, and sure enough, people take that for granted.\n\nThere used to be an alignment where OSS was to \"be against the corporate overloads of closed-source\", about \"freedom of choice and implementation\", about \"fair use licenses\". This was in opposition to Microsoft, Oracle, ATT unix, SCO unix, etc. But we all know what happened. The big names bought their way in, pumped up all the money making schemes, and now we see this trite marketing where billion dollar companies get to role play like they care about the communities which WE built over the past three+ decades. \n\nDon't believe me? Go look at the recent Fedora website redesign. Look at Canonical. There are many examples and one can find them easily by perusing the Distro-Watch list of a 100+ remakes.\n\nI'm in no way against corporate interest and benefit when it's ethical, when it's up-front and honest about its intentions. Though they are not my favorites of the world, at least Redhat and Oracle don't try to pull one over on the user with their main sites -- it's obvious that they are there for corporate players and for profitability, which is fine. I've paid for their licenses, for their hardware, many times in many ways, from personal use to license structures while operating a startup, so I'm not anti-corporation in the overall sense.\n\nHowever, this approach to \"we're all in this together\" fake messaging is tiresome. The irony of Fedora being owned by Redhat, who is owned by IBM; draw whatever conclusions one wants there, but they are all managed by different sectors.\n\nSo then, do we really need to be sold on the community aspect of what is inherently a community of developers working together for a shared goal? No, we do not, those are supposed to be intrisic and inherent qualities without need of mention. \n\nWho does it better? Here's a non-exhaustive short list from the top of my mind. \n\n- Gentoo (https://www.gentoo.org)\n- Chimera (https://chimera-linux.org)\n- SUSE (https://www.suse.com)\n- Void (https://voidlinux.org)\n\nDon't get me going on the BSDs... they are perfect and I love them, so it's a totally different conversation. 💗 \n",
				"date_published": "2025-04-21T06:53:47-05:00",
				"url": "https://prose.winterschon.com/2025/04/21/linux-kollektivs-oh-please.html",
				"tags": ["Industry","Engineering "]
			},
			{
				"id": "http://winterschon.micro.blog/2025/04/02/good-morning-stormy-spring-weather.html",
				
				"content_html": "<p>🩷 Good Morning Stormy Spring Weather 🩷</p>\n<p>#chicago #morning #photos #stormy #sleepy</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "🩷 Good Morning Stormy Spring Weather 🩷\n\n#chicago #morning #photos #stormy #sleepy\n\n<img src=\"https://prose.winterschon.com/uploads/2025/0e5b43e6a2.jpg\" width=\"600\" height=\"305\" alt=\"\">\n",
				"date_published": "2025-04-02T08:34:39-05:00",
				"url": "https://prose.winterschon.com/2025/04/02/good-morning-stormy-spring-weather.html",
				"tags": ["Photography "]
			},
			{
				"id": "http://winterschon.micro.blog/2025/04/01/hyperfocal-preoptimization.html",
				"title": "🤯 \"Hyper-Focal Pre-Optimization\" 🤯",
				"content_html": "<p>Coders from all over likely already know of this quote, or would certainly would benefit from perma-copying this quote to the front of their brain-stem/visual-cortex knowledge queue:</p>\n<blockquote>\n<p>“Premature optimization is the root of all evil.”\n― Donald Ervin Knuth, The Art of Computer Programming, Volume 1: Fundamental Algorithms</p>\n</blockquote>\n<p>So then, what&rsquo;s this about Hyper-Focal in relation? It&rsquo;s when one builds a &ldquo;maladapted neurological reward-center structured pattern of behavior&rdquo;.</p>\n<p>IOW, it&rsquo;s a learned behavior from which one has associated a perceived positive emotional reaction-feedback which they consider of benefit and thus worth repeating. This happens very deep in the subconscious mind, where most people have barely any awareness of (not meant as a slight, but simply most are not learned in that level of neuro-signals processing and neurotransmitter precision awareness (if one does have it, they&rsquo;ve likely endured extensive medical treatments and controls-isolation which border on Frankensteinian levels of research)).</p>\n<p>This type of learned behavior is due to the manner in which neurotransmitter signals processing is handled in the brain, based on dopamine secretion going through its paces in the pre-frontal cortex / nucleus accumbens / and mid-brain structures observed in the &ldquo;Mesocorticolimbic to Nigrostriatal Dopaminergic Pathway&rdquo;.</p>\n<p>The maladapted aspect occurs when that learned pattern of behavior has a flaw in its feedback loop, and is not as helpful to the person as they perceive; it persists as a detrimental behavioral loop. Though the person has associated this rising-tide of dopamine with the learned actions and pattern of behavior, something about its internal or external effects (which are very varied, because life is complex and sometimes complicated) has become detrimental and its adaptation to the user&rsquo;s inhabited space no longer properly &ldquo;fits the pattern to the maze&rdquo; (yes, we are all lab rats seeking cheese in this fine and glorious simulation).</p>\n<p>Ok fine, so what then? We can optimize, we can pre-optimize, we can post-optimize, and over-optimize these thousands of feedback loops in our behavioral structures&hellip; but it is through finding a balance to our internal modes of self-maintenance and self-awareness that we find the action-pattern markers of success: consistency, pleasure, happiness.</p>\n<p>This &ldquo;Dopaminergic Pathways to Action!&rdquo; topic can be simplified or go much deeper into the realms of cognitive neuro-psychology, but in knowing my own awareness patterns of behavior for 4am writing&hellip; I&rsquo;m going to stop for now.</p>\n<p>Yay Science!</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "Coders from all over likely already know of this quote, or would certainly would benefit from perma-copying this quote to the front of their brain-stem/visual-cortex knowledge queue:\r\n\r\n> “Premature optimization is the root of all evil.”\r\n> ― Donald Ervin Knuth, The Art of Computer Programming, Volume 1: Fundamental Algorithms\r\n\r\nSo then, what's this about Hyper-Focal in relation? It's when one builds a \"maladapted neurological reward-center structured pattern of behavior\".\r\n\r\nIOW, it's a learned behavior from which one has associated a perceived positive emotional reaction-feedback which they consider of benefit and thus worth repeating. This happens very deep in the subconscious mind, where most people have barely any awareness of (not meant as a slight, but simply most are not learned in that level of neuro-signals processing and neurotransmitter precision awareness (if one does have it, they've likely endured extensive medical treatments and controls-isolation which border on Frankensteinian levels of research)).\r\n\r\nThis type of learned behavior is due to the manner in which neurotransmitter signals processing is handled in the brain, based on dopamine secretion going through its paces in the pre-frontal cortex / nucleus accumbens / and mid-brain structures observed in the \"Mesocorticolimbic to Nigrostriatal Dopaminergic Pathway\".\r\n\r\nThe maladapted aspect occurs when that learned pattern of behavior has a flaw in its feedback loop, and is not as helpful to the person as they perceive; it persists as a detrimental behavioral loop. Though the person has associated this rising-tide of dopamine with the learned actions and pattern of behavior, something about its internal or external effects (which are very varied, because life is complex and sometimes complicated) has become detrimental and its adaptation to the user's inhabited space no longer properly \"fits the pattern to the maze\" (yes, we are all lab rats seeking cheese in this fine and glorious simulation).\r\n\r\nOk fine, so what then? We can optimize, we can pre-optimize, we can post-optimize, and over-optimize these thousands of feedback loops in our behavioral structures... but it is through finding a balance to our internal modes of self-maintenance and self-awareness that we find the action-pattern markers of success: consistency, pleasure, happiness. \r\n\r\nThis \"Dopaminergic Pathways to Action!\" topic can be simplified or go much deeper into the realms of cognitive neuro-psychology, but in knowing my own awareness patterns of behavior for 4am writing... I'm going to stop for now. \r\n\r\nYay Science! \r\n\n\n<img src=\"https://prose.winterschon.com/uploads/2025/dopaminergic-pathways.png\" width=\"446\" height=\"307\" alt=\"\"><img src=\"https://prose.winterschon.com/uploads/2025/mesocorticolimbic-circuit.png\" width=\"600\" height=\"546\" alt=\"\">\n",
				"date_published": "2025-04-01T05:36:51-05:00",
				"url": "https://prose.winterschon.com/2025/04/01/hyperfocal-preoptimization.html",
				"tags": ["Neurology"]
			},
			{
				"id": "http://winterschon.micro.blog/2025/01/03/freebsd-articles-q-projektierung.html",
				"title": "FreeBSD Articles 2025 Q1 [projektierung]",
				"content_html": "<p>These are the topics that I&rsquo;ve been spending time with, on no specific schedule, with no intended intention, often for debugging or optimization, sometimes purely for curiosity, and often in-between other tasks throughout the day and night, so they might as well get some blog posts for discussion. All of the topics have already been written via configs, scripts, list-docs, and automation tooling, but no formal blog posts just yet.</p>\n<ol>\n<li>Ongoing sprints in &ldquo;The EPYC Epic, Desktop Cooling Round III, Software Settings&rdquo;</li>\n<li>An Enterprise Engineering Desktop w/ FreeBSD: hardware, software, configs &amp; optimizations</li>\n<li>Terminal Living, Adventures with Shells, and Why I stopped using Bash after 22 years (sh, csh, tcsh, fish, nu, xonsh)</li>\n<li>Not the Biggest, nor Smallest: Porridge Bears settle on a heat sink for EPYC cooling</li>\n<li>Aerodynamics and Turbulent Efficacy: stfu Supermicro chassis fans</li>\n<li>Xorg Always Works: FreeBSD with the Big Three GPU brands, running 4K 240Hz 1000R on AMD, Intel, Nvidia</li>\n<li>FreeBSD Performance Analysis: machdep, c-states, turbo, and timecounter shootout</li>\n<li>Lazy Cores, Hot Nights: CPU idle algorithm optimization, core pinning, and NUMA balancing</li>\n</ol>\n<p>#FreeBSD #Engineering #Linux #Systems #Desktop</p>\n",
				"content_text": "These are the topics that I've been spending time with, on no specific schedule, with no intended intention, often for debugging or optimization, sometimes purely for curiosity, and often in-between other tasks throughout the day and night, so they might as well get some blog posts for discussion. All of the topics have already been written via configs, scripts, list-docs, and automation tooling, but no formal blog posts just yet.\r\n\r\n1. Ongoing sprints in \"The EPYC Epic, Desktop Cooling Round III, Software Settings\"\r\n2. An Enterprise Engineering Desktop w/ FreeBSD: hardware, software, configs & optimizations\r\n3. Terminal Living, Adventures with Shells, and Why I stopped using Bash after 22 years (sh, csh, tcsh, fish, nu, xonsh)\r\n4. Not the Biggest, nor Smallest: Porridge Bears settle on a heat sink for EPYC cooling\r\n5. Aerodynamics and Turbulent Efficacy: stfu Supermicro chassis fans\r\n6. Xorg Always Works: FreeBSD with the Big Three GPU brands, running 4K 240Hz 1000R on AMD, Intel, Nvidia\r\n7. FreeBSD Performance Analysis: machdep, c-states, turbo, and timecounter shootout\r\n8. Lazy Cores, Hot Nights: CPU idle algorithm optimization, core pinning, and NUMA balancing\r\n\r\n#FreeBSD #Engineering #Linux #Systems #Desktop\r\n",
				"date_published": "2025-01-03T06:15:03-05:00",
				"url": "https://prose.winterschon.com/2025/01/03/freebsd-articles-q-projektierung.html",
				"tags": ["Industry"]
			},
			{
				"id": "http://winterschon.micro.blog/2024/12/31/siren-song-of-the-ultrasparc.html",
				"title": "💖 Siren Song of the UltraSparc 💖",
				"content_html": "<pre tabindex=\"0\"><code>02:42, awoken to first-morning, 4hrs sleep\n02:55, at home office standing desk\n02:58, navigate to eBay once more\n02:59, search Sparc M7 T7-2 chassis\n03:08, begin writing silly poem\n03:12, resume eBay search\n03:16, distracted by dtrace for tcshrc\n03:20, distracted by view of Lake Michigan\n03:22, return to Mastodon post-form\n03:28, distracted by tcsh config options\n03:32, review work emails, updates too\n03:44, move poem to 'nb' program\n03:50, resume timeline planning for work\n04:30, paste to micro-blog, click 'post'\n\nnocturn lucid state of mind, nor-aware\nto this living within, this living dream\na call from asunder, singly sweet it rings\nt'was on the waves first heard 'n thought seen\nthirty-two cores, two-sockets she breathes\n.. &quot;come home my love, come rescue me&quot; ..\n\nperhaps one day or night so-soon 'oy-veh!\ndare say those waves may calm her songs\nan UltraSparc M7, no-more! no-less! yes yes!\nto dream of reveling in radiance so pure 'n fast\n'naught from those worlds above 'agast\n\nher wrists s'o slight, no strength for grasps\nt'was decades ago, burning searing flesh\nshe spoke no words to jest, nor loving gasps\nher scar a wound - a warning forever to last\n\nfünf Buchstaben besagen, the letters extolled\n&quot;come down from clouds ne' stray to golds!&quot;\n'a singing singeing salaciousness unfolds\n&quot;ye' now Icara, auf'dem lofty piercing blue!&quot;\n&quot;whence must you crash? no less'n to bruise!&quot;\n</code></pre>",
				"content_text": "```\n02:42, awoken to first-morning, 4hrs sleep\n02:55, at home office standing desk\n02:58, navigate to eBay once more\n02:59, search Sparc M7 T7-2 chassis\n03:08, begin writing silly poem\n03:12, resume eBay search\n03:16, distracted by dtrace for tcshrc\n03:20, distracted by view of Lake Michigan\n03:22, return to Mastodon post-form\n03:28, distracted by tcsh config options\n03:32, review work emails, updates too\n03:44, move poem to 'nb' program\n03:50, resume timeline planning for work\n04:30, paste to micro-blog, click 'post'\n\nnocturn lucid state of mind, nor-aware\nto this living within, this living dream\na call from asunder, singly sweet it rings\nt'was on the waves first heard 'n thought seen\nthirty-two cores, two-sockets she breathes\n.. \"come home my love, come rescue me\" ..\n\nperhaps one day or night so-soon 'oy-veh!\ndare say those waves may calm her songs\nan UltraSparc M7, no-more! no-less! yes yes!\nto dream of reveling in radiance so pure 'n fast\n'naught from those worlds above 'agast\n\nher wrists s'o slight, no strength for grasps\nt'was decades ago, burning searing flesh\nshe spoke no words to jest, nor loving gasps\nher scar a wound - a warning forever to last\n\nfünf Buchstaben besagen, the letters extolled\n\"come down from clouds ne' stray to golds!\"\n'a singing singeing salaciousness unfolds\n\"ye' now Icara, auf'dem lofty piercing blue!\"\n\"whence must you crash? no less'n to bruise!\"\n```\n",
				"date_published": "2024-12-31T05:32:47-05:00",
				"url": "https://prose.winterschon.com/2024/12/31/siren-song-of-the-ultrasparc.html",
				"tags": ["Musings","Emotive"]
			},
			{
				"id": "http://winterschon.micro.blog/2024/11/16/a-minor-commentary.html",
				"title": "A Minor Commentary on SED/Opal Encryption",
				"content_html": "<p>Data-At-Rest Encryption is a common topic, but one which is often misunderstood. Having led engineering and architectural efforts involved with hardware standards for encryption compliance, including detailed analysis of performance impacts while operating in accordance to service level agreements, here are some bits of discussion on the SED/Opal implementation.</p>\n<p><strong>TL;DR</strong></p>\n<ul>\n<li>SED/Opal TCG spec&rsquo;d drives are doing just fine. I trust it more than LUKS2 by a long shot.</li>\n</ul>\n<p><strong>Detailed Read</strong></p>\n<p>I have no issues trusting NAND and SAS firmware for the drive controllers that I&rsquo;ve personally validated as part of a hardware acquisition process for global fleets which require federally mandated encryption.</p>\n<p>Encryption compliance auditing is an involved process, as is the hardware validation process for identifying potential impacts to production storage performance workloads, and then there&rsquo;s adapting encryption compliance requirements to an org&rsquo;s procurement and provisioning pipelines, inc supply chain attack mitigations.</p>\n<p>All of those concerns apply to hardware shipped outside of the country into export-regulated zones that have tight controls over encryption compliance.</p>\n<p>Having been in charge of those workflows necessarily by job role, I can attest that it&rsquo;s not exactly roses and rabbits and chocolate teddy bears every day of the week during audit season, but it is rigorous and it does create secure data persistence across geopolitical zones and high-risk locales*.</p>\n<p><strong>USA Enc Regs</strong></p>\n<ul>\n<li>DoD: <a href=\"https://www.nsa.gov/portals/75/documents/resources/everyone/csfc/capability-packages/dar-cp.pdf\">www.nsa.gov/portals/7&hellip;</a></li>\n<li>NIST, Encryption for End-User Devices: <a href=\"https://nvlpubs.nist.gov/nistpubs/Legacy/SP/nistspecialpublication800-111.pdf\">nvlpubs.nist.gov/nistpubs/&hellip;</a></li>\n<li>HIPAA Encryption Overview: <a href=\"https://www.hipaajournal.com/hipaa-encryption-requirements/\">www.hipaajournal.com/hipaa-enc&hellip;</a>\nHIPAA Req via DHHS: <a href=\"https://www.ecfr.gov/current/title-45/subtitle-A/subchapter-C/part-164/subpart-C/section-164.312\">www.ecfr.gov/current/t&hellip;</a></li>\n</ul>\n<p><strong>LUKS2 CVEs</strong></p>\n<ul>\n<li><a href=\"https://www.cvedetails.com/cve/CVE-2021-4122/\">www.cvedetails.com/cve/CVE-2&hellip;</a></li>\n<li><a href=\"https://www.cvedetails.com/cve/CVE-2020-14382/\">www.cvedetails.com/cve/CVE-2&hellip;</a></li>\n<li><a href=\"https://www.cvedetails.com/cve/CVE-2016-4484/\">www.cvedetails.com/cve/CVE-2&hellip;</a></li>\n</ul>\n<p>For non-USA regs there are similar standards for modern first-world countries, though I trust the US&rsquo;s military industrial complex far more than anything from anywhere other than Germany (and to a lesser extent, also Japan).</p>\n<p><strong>Exo-Border Encryption IRL</strong></p>\n<ul>\n<li>My favorite story for that example are systems in several Taiwan datacenters which were seized by the CCP during the past N years. They didn&rsquo;t want to cut the power, given the facility&rsquo;s status and criticality, so the systems continued to run unabated until their dead-stage.</li>\n</ul>\n<p>Effectively this created a situation of situationally enfoced uptime. As long as any system was online it was fine, but no maintenaces were possible, and any drive failures remained forever-failed as no person was authorized to replace any hardware (even a simple hot-swap drive bay flip). Most of those systems are still online, vastly exceeding any manufacturer specs or expectations of SLA. When shipping sensitive data and secure systems around the world one must expect the worst, and that issue certainly wasn&rsquo;t the worst, at least the data is still live.</p>\n<p>Combat zones are an entirely different thing, and one can look to the Special Forces requirements for their portables to see how encryption standards work during active live-fire scenarios. It&rsquo;s often not enough to have encrypted drives; there must also be provisions for hot-swap/ejection of the hardware from its chassis, auto self-destruct features, and similar controls which seek to mitigate the less common edge-case concerns (torture, etc).</p>\n<p><strong>Original Conversation</strong>\nThis conversation began as part of a comment on my Mastodon account: <a href=\"https://mastodon.bsd.cafe/@winterschon/113481619191817945\">mastodon.bsd.cafe/@wintersc&hellip;</a></p>\n",
				"content_text": "Data-At-Rest Encryption is a common topic, but one which is often misunderstood. Having led engineering and architectural efforts involved with hardware standards for encryption compliance, including detailed analysis of performance impacts while operating in accordance to service level agreements, here are some bits of discussion on the SED/Opal implementation.\n\n**TL;DR**\n- SED/Opal TCG spec'd drives are doing just fine. I trust it more than LUKS2 by a long shot. \n\n\n**Detailed Read**\n\nI have no issues trusting NAND and SAS firmware for the drive controllers that I've personally validated as part of a hardware acquisition process for global fleets which require federally mandated encryption. \n\nEncryption compliance auditing is an involved process, as is the hardware validation process for identifying potential impacts to production storage performance workloads, and then there's adapting encryption compliance requirements to an org's procurement and provisioning pipelines, inc supply chain attack mitigations.\n\nAll of those concerns apply to hardware shipped outside of the country into export-regulated zones that have tight controls over encryption compliance. \n\nHaving been in charge of those workflows necessarily by job role, I can attest that it's not exactly roses and rabbits and chocolate teddy bears every day of the week during audit season, but it is rigorous and it does create secure data persistence across geopolitical zones and high-risk locales*. \n\n\n**USA Enc Regs**\n\n- DoD: [www.nsa.gov/portals/7...](https://www.nsa.gov/portals/75/documents/resources/everyone/csfc/capability-packages/dar-cp.pdf)\n- NIST, Encryption for End-User Devices: [nvlpubs.nist.gov/nistpubs/...](https://nvlpubs.nist.gov/nistpubs/Legacy/SP/nistspecialpublication800-111.pdf)\n- HIPAA Encryption Overview: [www.hipaajournal.com/hipaa-enc...](https://www.hipaajournal.com/hipaa-encryption-requirements/)\nHIPAA Req via DHHS: [www.ecfr.gov/current/t...](https://www.ecfr.gov/current/title-45/subtitle-A/subchapter-C/part-164/subpart-C/section-164.312)\n\n**LUKS2 CVEs**\n- [www.cvedetails.com/cve/CVE-2...](https://www.cvedetails.com/cve/CVE-2021-4122/)\n- [www.cvedetails.com/cve/CVE-2...](https://www.cvedetails.com/cve/CVE-2020-14382/)\n- [www.cvedetails.com/cve/CVE-2...](https://www.cvedetails.com/cve/CVE-2016-4484/)\n\nFor non-USA regs there are similar standards for modern first-world countries, though I trust the US's military industrial complex far more than anything from anywhere other than Germany (and to a lesser extent, also Japan).\n\n\n**Exo-Border Encryption IRL**\n\n* My favorite story for that example are systems in several Taiwan datacenters which were seized by the CCP during the past N years. They didn't want to cut the power, given the facility's status and criticality, so the systems continued to run unabated until their dead-stage. \n\nEffectively this created a situation of situationally enfoced uptime. As long as any system was online it was fine, but no maintenaces were possible, and any drive failures remained forever-failed as no person was authorized to replace any hardware (even a simple hot-swap drive bay flip). Most of those systems are still online, vastly exceeding any manufacturer specs or expectations of SLA. When shipping sensitive data and secure systems around the world one must expect the worst, and that issue certainly wasn't the worst, at least the data is still live. \n\nCombat zones are an entirely different thing, and one can look to the Special Forces requirements for their portables to see how encryption standards work during active live-fire scenarios. It's often not enough to have encrypted drives; there must also be provisions for hot-swap/ejection of the hardware from its chassis, auto self-destruct features, and similar controls which seek to mitigate the less common edge-case concerns (torture, etc).\n\n\n**Original Conversation**\nThis conversation began as part of a comment on my Mastodon account: [mastodon.bsd.cafe/@wintersc...](https://mastodon.bsd.cafe/@winterschon/113481619191817945)\n",
				"date_published": "2024-11-16T09:01:13-05:00",
				"url": "https://prose.winterschon.com/2024/11/16/a-minor-commentary.html",
				"tags": ["Industry"]
			},
			{
				"id": "http://winterschon.micro.blog/2024/08/15/performance-regressions-how.html",
				"title": "Performance \u0026 Regressions -- How Orgs Ship Code to Production",
				"content_html": "<p>See that image? Right around the mid-section we see a common problem with the manner in which code is shipped to production. That one little section, displayed as a subsection of &ldquo;build &amp; packaging&rdquo;, happily named &ldquo;regression + performance testing&rdquo;. Whether the product is a user-facing site, or middle-ware component, or baremetal systems which provide cloud resources that we all know and (sometimes) love&hellip; the success of the product is gated by an org&rsquo;s ability to prioritize testing and automations for &ldquo;Performance XOR Regression&rdquo; (some orgs consider them inclusive, some consider them separate).</p>\n<p>So we see Performance and Regressions visualized as practically a footnote, which is representative of the present landscape: many orgs don&rsquo;t understand regression at scale vs regression in labs vs regression modeling. Most concerning is that too many orgs fail to provide management directives which involve full Perf+Reg test coverage. Instead, as a result of the lack of understanding, many orgs expect that their engineering teams will miraculously &ldquo;make time&rdquo; in their fully allocated and often over-subscribed schedules. That is not possible, and when production suffers, we all suffer. (insert meme with person riding bike, then falling from their own mistakes, wincing in pain on the ground, painfully expressing &ldquo;Why would the code do this to us?&quot;)</p>\n<p>Secondly, a common misconception from engineering (eng teams and their management structure) is that Perf/Reg testing exists solely in that one stage. One simple misconception often causes an array of new and unnecessary tech debt, while often concurrently perpetuating existing tech debt.</p>\n<p>Ok. So who is not failing at Performance and Regression testing? We can look to the ground-breaking engineering efforts on projects which have defined the human race: Voyager I and II, the J.Webb Space Telescope, CERN&rsquo;s particle accelerators, and many others. What&rsquo;s the difference? Time and planning, adhering to standards, routine audits, change controls, and many more.</p>\n<p>How about simpler projects? Do they attend to P&amp;R as well as JBL or CERN or Los Alamos? Unfortunately not. Over the course of nearly a quarter century of focus on this and related topics, the strong majority of orgs which I&rsquo;ve had the pleasure of working at have engaged in &ldquo;Spectrum Testing&rdquo; instead of &ldquo;Binary Testing&rdquo; when it comes to performance + regression analysis, expecting that half-measures will be sufficient. They are not, and because this area of engineering requires investment of time, people, and hardware, it often becomes a budgetary line item to cross out during the times in which it is most critical. Such is the reality of simple and sometimes willful ignorance. Humans are fallible, expectedly so, but the beautiful thing is that we can change and learn and improve; but how&hellip; through awareness, analysis, and iterative adjustment (just like in engineering).</p>\n<p>Investing partially, whether fiscally or in human hours, is not sufficient. Planning these elements for success always requires time, hardware, and people: investment and awareness. No one sends a telescope into Lagrange orbit one half-million miles from earth without proper test coverage (this isn&rsquo;t the Hubble (sorry, sorry, I know it&rsquo;s not funny)). The reasons are obvious. However, back on terra, faulty and insufficiently tested code can deploy to a hyperscaler&rsquo;s cloud with sufficient impact that national and global infrastructure goes offline, and that code can ship without a second set of eyes? Yep. It happens, but it does not need to happen. We can expect better, and we should. Engineers and end-users and everyone else deserves better.</p>\n<p>Easier said than done, sure, but there are no improvements without intention and action. Orgs must be dedicated to P&amp;R coverage, and they must be receptive to potential improvements and course corrections. It requires management to be aware that &ldquo;performance&rdquo; does not imply &ldquo;efficiency&rdquo; and vice-versa. Quite simply, gaining any benefits from sufficient test coverage requires that management embrace improvements to &ldquo;testing culture&rdquo; within their org, and to ensure that sufficient time/cycles/bandwidth on each engineering team&rsquo;s schedule is inclusive of engagement with org-wide performance engineering directives.</p>\n<p>[1] LinkedIN image reference: <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:7229901279039291394\">www.linkedin.com/feed/upda&hellip;</a></p>\n",
				"content_text": "See that image? Right around the mid-section we see a common problem with the manner in which code is shipped to production. That one little section, displayed as a subsection of \"build & packaging\", happily named \"regression + performance testing\". Whether the product is a user-facing site, or middle-ware component, or baremetal systems which provide cloud resources that we all know and (sometimes) love... the success of the product is gated by an org's ability to prioritize testing and automations for \"Performance XOR Regression\" (some orgs consider them inclusive, some consider them separate).\n\nSo we see Performance and Regressions visualized as practically a footnote, which is representative of the present landscape: many orgs don't understand regression at scale vs regression in labs vs regression modeling. Most concerning is that too many orgs fail to provide management directives which involve full Perf+Reg test coverage. Instead, as a result of the lack of understanding, many orgs expect that their engineering teams will miraculously \"make time\" in their fully allocated and often over-subscribed schedules. That is not possible, and when production suffers, we all suffer. (insert meme with person riding bike, then falling from their own mistakes, wincing in pain on the ground, painfully expressing \"Why would the code do this to us?\")\n\nSecondly, a common misconception from engineering (eng teams and their management structure) is that Perf/Reg testing exists solely in that one stage. One simple misconception often causes an array of new and unnecessary tech debt, while often concurrently perpetuating existing tech debt.\n\nOk. So who is not failing at Performance and Regression testing? We can look to the ground-breaking engineering efforts on projects which have defined the human race: Voyager I and II, the J.Webb Space Telescope, CERN's particle accelerators, and many others. What's the difference? Time and planning, adhering to standards, routine audits, change controls, and many more.\n\nHow about simpler projects? Do they attend to P&R as well as JBL or CERN or Los Alamos? Unfortunately not. Over the course of nearly a quarter century of focus on this and related topics, the strong majority of orgs which I've had the pleasure of working at have engaged in \"Spectrum Testing\" instead of \"Binary Testing\" when it comes to performance + regression analysis, expecting that half-measures will be sufficient. They are not, and because this area of engineering requires investment of time, people, and hardware, it often becomes a budgetary line item to cross out during the times in which it is most critical. Such is the reality of simple and sometimes willful ignorance. Humans are fallible, expectedly so, but the beautiful thing is that we can change and learn and improve; but how... through awareness, analysis, and iterative adjustment (just like in engineering).\n\nInvesting partially, whether fiscally or in human hours, is not sufficient. Planning these elements for success always requires time, hardware, and people: investment and awareness. No one sends a telescope into Lagrange orbit one half-million miles from earth without proper test coverage (this isn't the Hubble (sorry, sorry, I know it's not funny)). The reasons are obvious. However, back on terra, faulty and insufficiently tested code can deploy to a hyperscaler's cloud with sufficient impact that national and global infrastructure goes offline, and that code can ship without a second set of eyes? Yep. It happens, but it does not need to happen. We can expect better, and we should. Engineers and end-users and everyone else deserves better.\n\nEasier said than done, sure, but there are no improvements without intention and action. Orgs must be dedicated to P&R coverage, and they must be receptive to potential improvements and course corrections. It requires management to be aware that \"performance\" does not imply \"efficiency\" and vice-versa. Quite simply, gaining any benefits from sufficient test coverage requires that management embrace improvements to \"testing culture\" within their org, and to ensure that sufficient time/cycles/bandwidth on each engineering team's schedule is inclusive of engagement with org-wide performance engineering directives.\n\n[1] LinkedIN image reference: [www.linkedin.com/feed/upda...](https://www.linkedin.com/feed/update/urn:li:activity:7229901279039291394)\n\n",
				"date_published": "2024-08-15T16:22:48-05:00",
				"url": "https://prose.winterschon.com/2024/08/15/performance-regressions-how.html"
			},
			{
				"id": "http://winterschon.micro.blog/2024/05/23/test-post-the.html",
				"title": "Everyone Loves Ansible",
				"content_html": "<p>Test post. The variable value specifies the vicissitudes of vectorized validity of variablities.</p>\n",
				"content_text": "Test post. The variable value specifies the vicissitudes of vectorized validity of variablities.\n",
				"date_published": "2024-05-23T16:00:51-05:00",
				"url": "https://prose.winterschon.com/2024/05/23/test-post-the.html"
			}
	]
}
