{
	"version": "https://jsonfeed.org/version/1",
	"title": "prose",
	"icon": "https://micro.blog/winterschon/avatar.jpg",
	"home_page_url": "https://prose.winterschon.com/",
	"feed_url": "https://prose.winterschon.com/feed.json",
	"items": [
		
			{
				"id": "http://winterschon.micro.blog/2025/04/24/updates-on-remote-access-to.html",
				"title": "💾 Updates on Remote Access to POWER9 💾",
				"content_html": "<p>Some quick progress notes for a few FreeBSD and OpenZFS devs, which will be accessing one of my POWER9 systems.</p>\n<p>See photos for visual reference.</p>\n<ul>\n<li>Separate L1 and L2 domain for all network access, zero-shared DMZ, unconnected to the rest of the RFC99 lab lack</li>\n<li>Mikrotik router has been temporarily slapped into place on the side of my lab rack, directly in back of the Talos II system (dual socket, 144 threads of fun!), using PoE for the main link</li>\n<li>PiKVM v3 is being cabled up for a jump box, will connect to the Mikrotik switch ports</li>\n<li>Talos II&rsquo;s OpenBMC will be connected to the Mikrotik switch ports, offering iKVM and ipmitool SoL terminal, which will be accessible via the jumpbox</li>\n<li>Wireguard tunnels will be allocated on the Mikrotik router for remote users</li>\n<li>APC PDU for remote power cycling (hard reboot style) of the Talos II is accessible via SNMP v3 authenticated command</li>\n</ul>\n<p>Later today on the &ldquo;Bhyve Production Users&rdquo; meeting, I&rsquo;ll go over those notes.</p>\n<ul>\n<li>Thursdays at 10am PST</li>\n<li>Recordings:  <a href=\"https://www.youtube.com/@callfortesting\">www.youtube.com/@callfort&hellip;</a></li>\n<li>More info: <a href=\"https://callfortesting.org\">callfortesting.org</a></li>\n</ul>\n<p><a href=\"https://micro.blog/dexter@bsd.network\">@dexter@bsd.network</a></p>\n<p>#freebsd #openzfs #power9 #engineering #opensource #networking #linux</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "Some quick progress notes for a few FreeBSD and OpenZFS devs, which will be accessing one of my POWER9 systems. \n\nSee photos for visual reference.\n\n- Separate L1 and L2 domain for all network access, zero-shared DMZ, unconnected to the rest of the RFC99 lab lack\n- Mikrotik router has been temporarily slapped into place on the side of my lab rack, directly in back of the Talos II system (dual socket, 144 threads of fun!), using PoE for the main link\n- PiKVM v3 is being cabled up for a jump box, will connect to the Mikrotik switch ports \n- Talos II's OpenBMC will be connected to the Mikrotik switch ports, offering iKVM and ipmitool SoL terminal, which will be accessible via the jumpbox\n- Wireguard tunnels will be allocated on the Mikrotik router for remote users\n- APC PDU for remote power cycling (hard reboot style) of the Talos II is accessible via SNMP v3 authenticated command \n\nLater today on the \"Bhyve Production Users\" meeting, I'll go over those notes. \n\n- Thursdays at 10am PST\n- Recordings:  [www.youtube.com/@callfort...](https://www.youtube.com/@callfortesting)\n- More info: [callfortesting.org](https://callfortesting.org)\n\n[@dexter@bsd.network](https://micro.blog/dexter@bsd.network)\n\n#freebsd #openzfs #power9 #engineering #opensource #networking #linux\n\n<img src=\"uploads/2025/cd1407b366.png\" width=\"600\" height=\"450\" alt=\"\"><img src=\"uploads/2025/7b381d59b3.jpg\" width=\"462\" height=\"600\" alt=\"\">\n",
				"date_published": "2025-04-24T10:39:38-05:00",
				"url": "https://prose.winterschon.com/2025/04/24/updates-on-remote-access-to.html",
				"tags": ["Industry","Photography ","Engineering "]
			},
			{
				"id": "http://winterschon.micro.blog/2025/04/21/linux-kollektivs-oh-please.html",
				"title": "⚒️ Linux Kollektivs - Oh Please ⚒️",
				"content_html": "<p>I love a lot about the linux world, and there&rsquo;s a lot of positive aspects to the kernel itself, which has brought a lot of joy over the years, with kernel module development, debugging, tuning, analyzing&hellip; specifically for my career, but also on a personal level. For one quarter of a century I&rsquo;ve been using Linux and BSDs in many different flavors, but there&rsquo;s an accelerating trend in the corporatized linux space which has been quite concerning.</p>\n<p>The marketing trends used by The Big Names over the past decade remind me far too much of Cold War propaganda, of the lies from literal communists which stained mine and many other&rsquo;s youthful years. Those lies fell apart in 1989 and we all hoped that would be the end of it&hellip; but of course not.</p>\n<p>The Perception</p>\n<blockquote>\n<p>Das Kollektiv der Gemeinschaft!\nWir sind für Sie da!\nSchließt euch den Reihen des Proletariats an und vernichtet den Menschen!</p>\n</blockquote>\n<p>Translated, loosely</p>\n<blockquote>\n<p>The collective of the community!\nWe are here for you!\nJoin the ranks of the proletariat and destroy the Man!</p>\n</blockquote>\n<p>I do not want your communism.\nI do not want your pseudo-cooperatives.\nI do not want your kollektiv of anything.</p>\n<p>We&rsquo;ve had our community this whole time, and the corporate influence was supposed to be secondary. We had to fight and push to get OSS into the corporate sphere for decades, and sure enough, people take that for granted.</p>\n<p>There used to be an alignment where OSS was to &ldquo;be against the corporate overloads of closed-source&rdquo;, about &ldquo;freedom of choice and implementation&rdquo;, about &ldquo;fair use licenses&rdquo;. This was in opposition to Microsoft, Oracle, ATT unix, SCO unix, etc. But we all know what happened. The big names bought their way in, pumped up all the money making schemes, and now we see this trite marketing where billion dollar companies get to role play like they care about the communities which WE built over the past three+ decades.</p>\n<p>Don&rsquo;t believe me? Go look at the recent Fedora website redesign. Look at Canonical. There are many examples and one can find them easily by perusing the Distro-Watch list of a 100+ remakes.</p>\n<p>I&rsquo;m in no way against corporate interest and benefit when it&rsquo;s ethical, when it&rsquo;s up-front and honest about its intentions. Though they are not my favorites of the world, at least Redhat and Oracle don&rsquo;t try to pull one over on the user with their main sites &ndash; it&rsquo;s obvious that they are there for corporate players and for profitability, which is fine. I&rsquo;ve paid for their licenses, for their hardware, many times in many ways, from personal use to license structures while operating a startup, so I&rsquo;m not anti-corporation in the overall sense.</p>\n<p>However, this approach to &ldquo;we&rsquo;re all in this together&rdquo; fake messaging is tiresome. The irony of Fedora being owned by Redhat, who is owned by IBM; draw whatever conclusions one wants there, but they are all managed by different sectors.</p>\n<p>So then, do we really need to be sold on the community aspect of what is inherently a community of developers working together for a shared goal? No, we do not, those are supposed to be intrisic and inherent qualities without need of mention.</p>\n<p>Who does it better? Here&rsquo;s a non-exhaustive short list from the top of my mind.</p>\n<ul>\n<li>Gentoo (<a href=\"https://www.gentoo.org\">https://www.gentoo.org</a>)</li>\n<li>Chimera (<a href=\"https://chimera-linux.org\">https://chimera-linux.org</a>)</li>\n<li>SUSE (<a href=\"https://www.suse.com\">https://www.suse.com</a>)</li>\n<li>Void (<a href=\"https://voidlinux.org\">https://voidlinux.org</a>)</li>\n</ul>\n<p>Don&rsquo;t get me going on the BSDs&hellip; they are perfect and I love them, so it&rsquo;s a totally different conversation. 💗</p>\n",
				"content_text": "I love a lot about the linux world, and there's a lot of positive aspects to the kernel itself, which has brought a lot of joy over the years, with kernel module development, debugging, tuning, analyzing... specifically for my career, but also on a personal level. For one quarter of a century I've been using Linux and BSDs in many different flavors, but there's an accelerating trend in the corporatized linux space which has been quite concerning.\n\nThe marketing trends used by The Big Names over the past decade remind me far too much of Cold War propaganda, of the lies from literal communists which stained mine and many other's youthful years. Those lies fell apart in 1989 and we all hoped that would be the end of it... but of course not.\n\nThe Perception\n> Das Kollektiv der Gemeinschaft!\n> Wir sind für Sie da! \n> Schließt euch den Reihen des Proletariats an und vernichtet den Menschen!\n\nTranslated, loosely\n> The collective of the community!\n> We are here for you!\n> Join the ranks of the proletariat and destroy the Man!\n\nI do not want your communism.\nI do not want your pseudo-cooperatives.\nI do not want your kollektiv of anything.\n\nWe've had our community this whole time, and the corporate influence was supposed to be secondary. We had to fight and push to get OSS into the corporate sphere for decades, and sure enough, people take that for granted.\n\nThere used to be an alignment where OSS was to \"be against the corporate overloads of closed-source\", about \"freedom of choice and implementation\", about \"fair use licenses\". This was in opposition to Microsoft, Oracle, ATT unix, SCO unix, etc. But we all know what happened. The big names bought their way in, pumped up all the money making schemes, and now we see this trite marketing where billion dollar companies get to role play like they care about the communities which WE built over the past three+ decades. \n\nDon't believe me? Go look at the recent Fedora website redesign. Look at Canonical. There are many examples and one can find them easily by perusing the Distro-Watch list of a 100+ remakes.\n\nI'm in no way against corporate interest and benefit when it's ethical, when it's up-front and honest about its intentions. Though they are not my favorites of the world, at least Redhat and Oracle don't try to pull one over on the user with their main sites -- it's obvious that they are there for corporate players and for profitability, which is fine. I've paid for their licenses, for their hardware, many times in many ways, from personal use to license structures while operating a startup, so I'm not anti-corporation in the overall sense.\n\nHowever, this approach to \"we're all in this together\" fake messaging is tiresome. The irony of Fedora being owned by Redhat, who is owned by IBM; draw whatever conclusions one wants there, but they are all managed by different sectors.\n\nSo then, do we really need to be sold on the community aspect of what is inherently a community of developers working together for a shared goal? No, we do not, those are supposed to be intrisic and inherent qualities without need of mention. \n\nWho does it better? Here's a non-exhaustive short list from the top of my mind. \n\n- Gentoo (https://www.gentoo.org)\n- Chimera (https://chimera-linux.org)\n- SUSE (https://www.suse.com)\n- Void (https://voidlinux.org)\n\nDon't get me going on the BSDs... they are perfect and I love them, so it's a totally different conversation. 💗 \n",
				"date_published": "2025-04-21T06:53:47-05:00",
				"url": "https://prose.winterschon.com/2025/04/21/linux-kollektivs-oh-please.html",
				"tags": ["Industry","Engineering "]
			},
			{
				"id": "http://winterschon.micro.blog/2025/04/02/good-morning-stormy-spring-weather.html",
				
				"content_html": "<p>🩷 Good Morning Stormy Spring Weather 🩷</p>\n<p>#chicago #morning #photos #stormy #sleepy</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "🩷 Good Morning Stormy Spring Weather 🩷\n\n#chicago #morning #photos #stormy #sleepy\n\n<img src=\"uploads/2025/0e5b43e6a2.jpg\" width=\"600\" height=\"305\" alt=\"\">\n",
				"date_published": "2025-04-02T08:34:39-05:00",
				"url": "https://prose.winterschon.com/2025/04/02/good-morning-stormy-spring-weather.html",
				"tags": ["Photography "]
			},
			{
				"id": "http://winterschon.micro.blog/2025/04/01/hyperfocal-preoptimization.html",
				"title": "🤯 \"Hyper-Focal Pre-Optimization\" 🤯",
				"content_html": "<p>Coders from all over likely already know of this quote, or would certainly would benefit from perma-copying this quote to the front of their brain-stem/visual-cortex knowledge queue:</p>\n<blockquote>\n<p>“Premature optimization is the root of all evil.”\n― Donald Ervin Knuth, The Art of Computer Programming, Volume 1: Fundamental Algorithms</p>\n</blockquote>\n<p>So then, what&rsquo;s this about Hyper-Focal in relation? It&rsquo;s when one builds a &ldquo;maladapted neurological reward-center structured pattern of behavior&rdquo;.</p>\n<p>IOW, it&rsquo;s a learned behavior from which one has associated a perceived positive emotional reaction-feedback which they consider of benefit and thus worth repeating. This happens very deep in the subconscious mind, where most people have barely any awareness of (not meant as a slight, but simply most are not learned in that level of neuro-signals processing and neurotransmitter precision awareness (if one does have it, they&rsquo;ve likely endured extensive medical treatments and controls-isolation which border on Frankensteinian levels of research)).</p>\n<p>This type of learned behavior is due to the manner in which neurotransmitter signals processing is handled in the brain, based on dopamine secretion going through its paces in the pre-frontal cortex / nucleus accumbens / and mid-brain structures observed in the &ldquo;Mesocorticolimbic to Nigrostriatal Dopaminergic Pathway&rdquo;.</p>\n<p>The maladapted aspect occurs when that learned pattern of behavior has a flaw in its feedback loop, and is not as helpful to the person as they perceive; it persists as a detrimental behavioral loop. Though the person has associated this rising-tide of dopamine with the learned actions and pattern of behavior, something about its internal or external effects (which are very varied, because life is complex and sometimes complicated) has become detrimental and its adaptation to the user&rsquo;s inhabited space no longer properly &ldquo;fits the pattern to the maze&rdquo; (yes, we are all lab rats seeking cheese in this fine and glorious simulation).</p>\n<p>Ok fine, so what then? We can optimize, we can pre-optimize, we can post-optimize, and over-optimize these thousands of feedback loops in our behavioral structures&hellip; but it is through finding a balance to our internal modes of self-maintenance and self-awareness that we find the action-pattern markers of success: consistency, pleasure, happiness.</p>\n<p>This &ldquo;Dopaminergic Pathways to Action!&rdquo; topic can be simplified or go much deeper into the realms of cognitive neuro-psychology, but in knowing my own awareness patterns of behavior for 4am writing&hellip; I&rsquo;m going to stop for now.</p>\n<p>Yay Science!</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "Coders from all over likely already know of this quote, or would certainly would benefit from perma-copying this quote to the front of their brain-stem/visual-cortex knowledge queue:\r\n\r\n> “Premature optimization is the root of all evil.”\r\n> ― Donald Ervin Knuth, The Art of Computer Programming, Volume 1: Fundamental Algorithms\r\n\r\nSo then, what's this about Hyper-Focal in relation? It's when one builds a \"maladapted neurological reward-center structured pattern of behavior\".\r\n\r\nIOW, it's a learned behavior from which one has associated a perceived positive emotional reaction-feedback which they consider of benefit and thus worth repeating. This happens very deep in the subconscious mind, where most people have barely any awareness of (not meant as a slight, but simply most are not learned in that level of neuro-signals processing and neurotransmitter precision awareness (if one does have it, they've likely endured extensive medical treatments and controls-isolation which border on Frankensteinian levels of research)).\r\n\r\nThis type of learned behavior is due to the manner in which neurotransmitter signals processing is handled in the brain, based on dopamine secretion going through its paces in the pre-frontal cortex / nucleus accumbens / and mid-brain structures observed in the \"Mesocorticolimbic to Nigrostriatal Dopaminergic Pathway\".\r\n\r\nThe maladapted aspect occurs when that learned pattern of behavior has a flaw in its feedback loop, and is not as helpful to the person as they perceive; it persists as a detrimental behavioral loop. Though the person has associated this rising-tide of dopamine with the learned actions and pattern of behavior, something about its internal or external effects (which are very varied, because life is complex and sometimes complicated) has become detrimental and its adaptation to the user's inhabited space no longer properly \"fits the pattern to the maze\" (yes, we are all lab rats seeking cheese in this fine and glorious simulation).\r\n\r\nOk fine, so what then? We can optimize, we can pre-optimize, we can post-optimize, and over-optimize these thousands of feedback loops in our behavioral structures... but it is through finding a balance to our internal modes of self-maintenance and self-awareness that we find the action-pattern markers of success: consistency, pleasure, happiness. \r\n\r\nThis \"Dopaminergic Pathways to Action!\" topic can be simplified or go much deeper into the realms of cognitive neuro-psychology, but in knowing my own awareness patterns of behavior for 4am writing... I'm going to stop for now. \r\n\r\nYay Science! \r\n\n\n<img src=\"uploads/2025/dopaminergic-pathways.png\" width=\"446\" height=\"307\" alt=\"\"><img src=\"uploads/2025/mesocorticolimbic-circuit.png\" width=\"600\" height=\"546\" alt=\"\">\n",
				"date_published": "2025-04-01T05:36:51-05:00",
				"url": "https://prose.winterschon.com/2025/04/01/hyperfocal-preoptimization.html",
				"tags": ["Neurology"]
			},
			{
				"id": "http://winterschon.micro.blog/2025/01/03/freebsd-articles-q-projektierung.html",
				"title": "FreeBSD Articles 2025 Q1 [projektierung]",
				"content_html": "<p>These are the topics that I&rsquo;ve been spending time with, on no specific schedule, with no intended intention, often for debugging or optimization, sometimes purely for curiosity, and often in-between other tasks throughout the day and night, so they might as well get some blog posts for discussion. All of the topics have already been written via configs, scripts, list-docs, and automation tooling, but no formal blog posts just yet.</p>\n<ol>\n<li>Ongoing sprints in &ldquo;The EPYC Epic, Desktop Cooling Round III, Software Settings&rdquo;</li>\n<li>An Enterprise Engineering Desktop w/ FreeBSD: hardware, software, configs &amp; optimizations</li>\n<li>Terminal Living, Adventures with Shells, and Why I stopped using Bash after 22 years (sh, csh, tcsh, fish, nu, xonsh)</li>\n<li>Not the Biggest, nor Smallest: Porridge Bears settle on a heat sink for EPYC cooling</li>\n<li>Aerodynamics and Turbulent Efficacy: stfu Supermicro chassis fans</li>\n<li>Xorg Always Works: FreeBSD with the Big Three GPU brands, running 4K 240Hz 1000R on AMD, Intel, Nvidia</li>\n<li>FreeBSD Performance Analysis: machdep, c-states, turbo, and timecounter shootout</li>\n<li>Lazy Cores, Hot Nights: CPU idle algorithm optimization, core pinning, and NUMA balancing</li>\n</ol>\n<p>#FreeBSD #Engineering #Linux #Systems #Desktop</p>\n",
				"content_text": "These are the topics that I've been spending time with, on no specific schedule, with no intended intention, often for debugging or optimization, sometimes purely for curiosity, and often in-between other tasks throughout the day and night, so they might as well get some blog posts for discussion. All of the topics have already been written via configs, scripts, list-docs, and automation tooling, but no formal blog posts just yet.\r\n\r\n1. Ongoing sprints in \"The EPYC Epic, Desktop Cooling Round III, Software Settings\"\r\n2. An Enterprise Engineering Desktop w/ FreeBSD: hardware, software, configs & optimizations\r\n3. Terminal Living, Adventures with Shells, and Why I stopped using Bash after 22 years (sh, csh, tcsh, fish, nu, xonsh)\r\n4. Not the Biggest, nor Smallest: Porridge Bears settle on a heat sink for EPYC cooling\r\n5. Aerodynamics and Turbulent Efficacy: stfu Supermicro chassis fans\r\n6. Xorg Always Works: FreeBSD with the Big Three GPU brands, running 4K 240Hz 1000R on AMD, Intel, Nvidia\r\n7. FreeBSD Performance Analysis: machdep, c-states, turbo, and timecounter shootout\r\n8. Lazy Cores, Hot Nights: CPU idle algorithm optimization, core pinning, and NUMA balancing\r\n\r\n#FreeBSD #Engineering #Linux #Systems #Desktop\r\n",
				"date_published": "2025-01-03T06:15:03-05:00",
				"url": "https://prose.winterschon.com/2025/01/03/freebsd-articles-q-projektierung.html",
				"tags": ["Industry"]
			},
			{
				"id": "http://winterschon.micro.blog/2024/12/31/siren-song-of-the-ultrasparc.html",
				"title": "💖 Siren Song of the UltraSparc 💖",
				"content_html": "<pre tabindex=\"0\"><code>02:42, awoken to first-morning, 4hrs sleep\n02:55, at home office standing desk\n02:58, navigate to eBay once more\n02:59, search Sparc M7 T7-2 chassis\n03:08, begin writing silly poem\n03:12, resume eBay search\n03:16, distracted by dtrace for tcshrc\n03:20, distracted by view of Lake Michigan\n03:22, return to Mastodon post-form\n03:28, distracted by tcsh config options\n03:32, review work emails, updates too\n03:44, move poem to 'nb' program\n03:50, resume timeline planning for work\n04:30, paste to micro-blog, click 'post'\n\nnocturn lucid state of mind, nor-aware\nto this living within, this living dream\na call from asunder, singly sweet it rings\nt'was on the waves first heard 'n thought seen\nthirty-two cores, two-sockets she breathes\n.. &quot;come home my love, come rescue me&quot; ..\n\nperhaps one day or night so-soon 'oy-veh!\ndare say those waves may calm her songs\nan UltraSparc M7, no-more! no-less! yes yes!\nto dream of reveling in radiance so pure 'n fast\n'naught from those worlds above 'agast\n\nher wrists s'o slight, no strength for grasps\nt'was decades ago, burning searing flesh\nshe spoke no words to jest, nor loving gasps\nher scar a wound - a warning forever to last\n\nfünf Buchstaben besagen, the letters extolled\n&quot;come down from clouds ne' stray to golds!&quot;\n'a singing singeing salaciousness unfolds\n&quot;ye' now Icara, auf'dem lofty piercing blue!&quot;\n&quot;whence must you crash? no less'n to bruise!&quot;\n</code></pre>",
				"content_text": "```\n02:42, awoken to first-morning, 4hrs sleep\n02:55, at home office standing desk\n02:58, navigate to eBay once more\n02:59, search Sparc M7 T7-2 chassis\n03:08, begin writing silly poem\n03:12, resume eBay search\n03:16, distracted by dtrace for tcshrc\n03:20, distracted by view of Lake Michigan\n03:22, return to Mastodon post-form\n03:28, distracted by tcsh config options\n03:32, review work emails, updates too\n03:44, move poem to 'nb' program\n03:50, resume timeline planning for work\n04:30, paste to micro-blog, click 'post'\n\nnocturn lucid state of mind, nor-aware\nto this living within, this living dream\na call from asunder, singly sweet it rings\nt'was on the waves first heard 'n thought seen\nthirty-two cores, two-sockets she breathes\n.. \"come home my love, come rescue me\" ..\n\nperhaps one day or night so-soon 'oy-veh!\ndare say those waves may calm her songs\nan UltraSparc M7, no-more! no-less! yes yes!\nto dream of reveling in radiance so pure 'n fast\n'naught from those worlds above 'agast\n\nher wrists s'o slight, no strength for grasps\nt'was decades ago, burning searing flesh\nshe spoke no words to jest, nor loving gasps\nher scar a wound - a warning forever to last\n\nfünf Buchstaben besagen, the letters extolled\n\"come down from clouds ne' stray to golds!\"\n'a singing singeing salaciousness unfolds\n\"ye' now Icara, auf'dem lofty piercing blue!\"\n\"whence must you crash? no less'n to bruise!\"\n```\n",
				"date_published": "2024-12-31T05:32:47-05:00",
				"url": "https://prose.winterschon.com/2024/12/31/siren-song-of-the-ultrasparc.html",
				"tags": ["Musings","Emotive"]
			},
			{
				"id": "http://winterschon.micro.blog/2024/11/16/a-minor-commentary.html",
				"title": "A Minor Commentary on SED/Opal Encryption",
				"content_html": "<p>Data-At-Rest Encryption is a common topic, but one which is often misunderstood. Having led engineering and architectural efforts involved with hardware standards for encryption compliance, including detailed analysis of performance impacts while operating in accordance to service level agreements, here are some bits of discussion on the SED/Opal implementation.</p>\n<p><strong>TL;DR</strong></p>\n<ul>\n<li>SED/Opal TCG spec&rsquo;d drives are doing just fine. I trust it more than LUKS2 by a long shot.</li>\n</ul>\n<p><strong>Detailed Read</strong></p>\n<p>I have no issues trusting NAND and SAS firmware for the drive controllers that I&rsquo;ve personally validated as part of a hardware acquisition process for global fleets which require federally mandated encryption.</p>\n<p>Encryption compliance auditing is an involved process, as is the hardware validation process for identifying potential impacts to production storage performance workloads, and then there&rsquo;s adapting encryption compliance requirements to an org&rsquo;s procurement and provisioning pipelines, inc supply chain attack mitigations.</p>\n<p>All of those concerns apply to hardware shipped outside of the country into export-regulated zones that have tight controls over encryption compliance.</p>\n<p>Having been in charge of those workflows necessarily by job role, I can attest that it&rsquo;s not exactly roses and rabbits and chocolate teddy bears every day of the week during audit season, but it is rigorous and it does create secure data persistence across geopolitical zones and high-risk locales*.</p>\n<p><strong>USA Enc Regs</strong></p>\n<ul>\n<li>DoD: <a href=\"https://www.nsa.gov/portals/75/documents/resources/everyone/csfc/capability-packages/dar-cp.pdf\">www.nsa.gov/portals/7&hellip;</a></li>\n<li>NIST, Encryption for End-User Devices: <a href=\"https://nvlpubs.nist.gov/nistpubs/Legacy/SP/nistspecialpublication800-111.pdf\">nvlpubs.nist.gov/nistpubs/&hellip;</a></li>\n<li>HIPAA Encryption Overview: <a href=\"https://www.hipaajournal.com/hipaa-encryption-requirements/\">www.hipaajournal.com/hipaa-enc&hellip;</a>\nHIPAA Req via DHHS: <a href=\"https://www.ecfr.gov/current/title-45/subtitle-A/subchapter-C/part-164/subpart-C/section-164.312\">www.ecfr.gov/current/t&hellip;</a></li>\n</ul>\n<p><strong>LUKS2 CVEs</strong></p>\n<ul>\n<li><a href=\"https://www.cvedetails.com/cve/CVE-2021-4122/\">www.cvedetails.com/cve/CVE-2&hellip;</a></li>\n<li><a href=\"https://www.cvedetails.com/cve/CVE-2020-14382/\">www.cvedetails.com/cve/CVE-2&hellip;</a></li>\n<li><a href=\"https://www.cvedetails.com/cve/CVE-2016-4484/\">www.cvedetails.com/cve/CVE-2&hellip;</a></li>\n</ul>\n<p>For non-USA regs there are similar standards for modern first-world countries, though I trust the US&rsquo;s military industrial complex far more than anything from anywhere other than Germany (and to a lesser extent, also Japan).</p>\n<p><strong>Exo-Border Encryption IRL</strong></p>\n<ul>\n<li>My favorite story for that example are systems in several Taiwan datacenters which were seized by the CCP during the past N years. They didn&rsquo;t want to cut the power, given the facility&rsquo;s status and criticality, so the systems continued to run unabated until their dead-stage.</li>\n</ul>\n<p>Effectively this created a situation of situationally enfoced uptime. As long as any system was online it was fine, but no maintenaces were possible, and any drive failures remained forever-failed as no person was authorized to replace any hardware (even a simple hot-swap drive bay flip). Most of those systems are still online, vastly exceeding any manufacturer specs or expectations of SLA. When shipping sensitive data and secure systems around the world one must expect the worst, and that issue certainly wasn&rsquo;t the worst, at least the data is still live.</p>\n<p>Combat zones are an entirely different thing, and one can look to the Special Forces requirements for their portables to see how encryption standards work during active live-fire scenarios. It&rsquo;s often not enough to have encrypted drives; there must also be provisions for hot-swap/ejection of the hardware from its chassis, auto self-destruct features, and similar controls which seek to mitigate the less common edge-case concerns (torture, etc).</p>\n<p><strong>Original Conversation</strong>\nThis conversation began as part of a comment on my Mastodon account: <a href=\"https://mastodon.bsd.cafe/@winterschon/113481619191817945\">mastodon.bsd.cafe/@wintersc&hellip;</a></p>\n",
				"content_text": "Data-At-Rest Encryption is a common topic, but one which is often misunderstood. Having led engineering and architectural efforts involved with hardware standards for encryption compliance, including detailed analysis of performance impacts while operating in accordance to service level agreements, here are some bits of discussion on the SED/Opal implementation.\n\n**TL;DR**\n- SED/Opal TCG spec'd drives are doing just fine. I trust it more than LUKS2 by a long shot. \n\n\n**Detailed Read**\n\nI have no issues trusting NAND and SAS firmware for the drive controllers that I've personally validated as part of a hardware acquisition process for global fleets which require federally mandated encryption. \n\nEncryption compliance auditing is an involved process, as is the hardware validation process for identifying potential impacts to production storage performance workloads, and then there's adapting encryption compliance requirements to an org's procurement and provisioning pipelines, inc supply chain attack mitigations.\n\nAll of those concerns apply to hardware shipped outside of the country into export-regulated zones that have tight controls over encryption compliance. \n\nHaving been in charge of those workflows necessarily by job role, I can attest that it's not exactly roses and rabbits and chocolate teddy bears every day of the week during audit season, but it is rigorous and it does create secure data persistence across geopolitical zones and high-risk locales*. \n\n\n**USA Enc Regs**\n\n- DoD: [www.nsa.gov/portals/7...](https://www.nsa.gov/portals/75/documents/resources/everyone/csfc/capability-packages/dar-cp.pdf)\n- NIST, Encryption for End-User Devices: [nvlpubs.nist.gov/nistpubs/...](https://nvlpubs.nist.gov/nistpubs/Legacy/SP/nistspecialpublication800-111.pdf)\n- HIPAA Encryption Overview: [www.hipaajournal.com/hipaa-enc...](https://www.hipaajournal.com/hipaa-encryption-requirements/)\nHIPAA Req via DHHS: [www.ecfr.gov/current/t...](https://www.ecfr.gov/current/title-45/subtitle-A/subchapter-C/part-164/subpart-C/section-164.312)\n\n**LUKS2 CVEs**\n- [www.cvedetails.com/cve/CVE-2...](https://www.cvedetails.com/cve/CVE-2021-4122/)\n- [www.cvedetails.com/cve/CVE-2...](https://www.cvedetails.com/cve/CVE-2020-14382/)\n- [www.cvedetails.com/cve/CVE-2...](https://www.cvedetails.com/cve/CVE-2016-4484/)\n\nFor non-USA regs there are similar standards for modern first-world countries, though I trust the US's military industrial complex far more than anything from anywhere other than Germany (and to a lesser extent, also Japan).\n\n\n**Exo-Border Encryption IRL**\n\n* My favorite story for that example are systems in several Taiwan datacenters which were seized by the CCP during the past N years. They didn't want to cut the power, given the facility's status and criticality, so the systems continued to run unabated until their dead-stage. \n\nEffectively this created a situation of situationally enfoced uptime. As long as any system was online it was fine, but no maintenaces were possible, and any drive failures remained forever-failed as no person was authorized to replace any hardware (even a simple hot-swap drive bay flip). Most of those systems are still online, vastly exceeding any manufacturer specs or expectations of SLA. When shipping sensitive data and secure systems around the world one must expect the worst, and that issue certainly wasn't the worst, at least the data is still live. \n\nCombat zones are an entirely different thing, and one can look to the Special Forces requirements for their portables to see how encryption standards work during active live-fire scenarios. It's often not enough to have encrypted drives; there must also be provisions for hot-swap/ejection of the hardware from its chassis, auto self-destruct features, and similar controls which seek to mitigate the less common edge-case concerns (torture, etc).\n\n\n**Original Conversation**\nThis conversation began as part of a comment on my Mastodon account: [mastodon.bsd.cafe/@wintersc...](https://mastodon.bsd.cafe/@winterschon/113481619191817945)\n",
				"date_published": "2024-11-16T09:01:13-05:00",
				"url": "https://prose.winterschon.com/2024/11/16/a-minor-commentary.html",
				"tags": ["Industry"]
			},
			{
				"id": "http://winterschon.micro.blog/2024/08/15/performance-regressions-how.html",
				"title": "Performance \u0026 Regressions -- How Orgs Ship Code to Production",
				"content_html": "<p>See that image? Right around the mid-section we see a common problem with the manner in which code is shipped to production. That one little section, displayed as a subsection of &ldquo;build &amp; packaging&rdquo;, happily named &ldquo;regression + performance testing&rdquo;. Whether the product is a user-facing site, or middle-ware component, or baremetal systems which provide cloud resources that we all know and (sometimes) love&hellip; the success of the product is gated by an org&rsquo;s ability to prioritize testing and automations for &ldquo;Performance XOR Regression&rdquo; (some orgs consider them inclusive, some consider them separate).</p>\n<p>So we see Performance and Regressions visualized as practically a footnote, which is representative of the present landscape: many orgs don&rsquo;t understand regression at scale vs regression in labs vs regression modeling. Most concerning is that too many orgs fail to provide management directives which involve full Perf+Reg test coverage. Instead, as a result of the lack of understanding, many orgs expect that their engineering teams will miraculously &ldquo;make time&rdquo; in their fully allocated and often over-subscribed schedules. That is not possible, and when production suffers, we all suffer. (insert meme with person riding bike, then falling from their own mistakes, wincing in pain on the ground, painfully expressing &ldquo;Why would the code do this to us?&quot;)</p>\n<p>Secondly, a common misconception from engineering (eng teams and their management structure) is that Perf/Reg testing exists solely in that one stage. One simple misconception often causes an array of new and unnecessary tech debt, while often concurrently perpetuating existing tech debt.</p>\n<p>Ok. So who is not failing at Performance and Regression testing? We can look to the ground-breaking engineering efforts on projects which have defined the human race: Voyager I and II, the J.Webb Space Telescope, CERN&rsquo;s particle accelerators, and many others. What&rsquo;s the difference? Time and planning, adhering to standards, routine audits, change controls, and many more.</p>\n<p>How about simpler projects? Do they attend to P&amp;R as well as JBL or CERN or Los Alamos? Unfortunately not. Over the course of nearly a quarter century of focus on this and related topics, the strong majority of orgs which I&rsquo;ve had the pleasure of working at have engaged in &ldquo;Spectrum Testing&rdquo; instead of &ldquo;Binary Testing&rdquo; when it comes to performance + regression analysis, expecting that half-measures will be sufficient. They are not, and because this area of engineering requires investment of time, people, and hardware, it often becomes a budgetary line item to cross out during the times in which it is most critical. Such is the reality of simple and sometimes willful ignorance. Humans are fallible, expectedly so, but the beautiful thing is that we can change and learn and improve; but how&hellip; through awareness, analysis, and iterative adjustment (just like in engineering).</p>\n<p>Investing partially, whether fiscally or in human hours, is not sufficient. Planning these elements for success always requires time, hardware, and people: investment and awareness. No one sends a telescope into Lagrange orbit one half-million miles from earth without proper test coverage (this isn&rsquo;t the Hubble (sorry, sorry, I know it&rsquo;s not funny)). The reasons are obvious. However, back on terra, faulty and insufficiently tested code can deploy to a hyperscaler&rsquo;s cloud with sufficient impact that national and global infrastructure goes offline, and that code can ship without a second set of eyes? Yep. It happens, but it does not need to happen. We can expect better, and we should. Engineers and end-users and everyone else deserves better.</p>\n<p>Easier said than done, sure, but there are no improvements without intention and action. Orgs must be dedicated to P&amp;R coverage, and they must be receptive to potential improvements and course corrections. It requires management to be aware that &ldquo;performance&rdquo; does not imply &ldquo;efficiency&rdquo; and vice-versa. Quite simply, gaining any benefits from sufficient test coverage requires that management embrace improvements to &ldquo;testing culture&rdquo; within their org, and to ensure that sufficient time/cycles/bandwidth on each engineering team&rsquo;s schedule is inclusive of engagement with org-wide performance engineering directives.</p>\n<p>[1] LinkedIN image reference: <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:7229901279039291394\">www.linkedin.com/feed/upda&hellip;</a></p>\n",
				"content_text": "See that image? Right around the mid-section we see a common problem with the manner in which code is shipped to production. That one little section, displayed as a subsection of \"build & packaging\", happily named \"regression + performance testing\". Whether the product is a user-facing site, or middle-ware component, or baremetal systems which provide cloud resources that we all know and (sometimes) love... the success of the product is gated by an org's ability to prioritize testing and automations for \"Performance XOR Regression\" (some orgs consider them inclusive, some consider them separate).\n\nSo we see Performance and Regressions visualized as practically a footnote, which is representative of the present landscape: many orgs don't understand regression at scale vs regression in labs vs regression modeling. Most concerning is that too many orgs fail to provide management directives which involve full Perf+Reg test coverage. Instead, as a result of the lack of understanding, many orgs expect that their engineering teams will miraculously \"make time\" in their fully allocated and often over-subscribed schedules. That is not possible, and when production suffers, we all suffer. (insert meme with person riding bike, then falling from their own mistakes, wincing in pain on the ground, painfully expressing \"Why would the code do this to us?\")\n\nSecondly, a common misconception from engineering (eng teams and their management structure) is that Perf/Reg testing exists solely in that one stage. One simple misconception often causes an array of new and unnecessary tech debt, while often concurrently perpetuating existing tech debt.\n\nOk. So who is not failing at Performance and Regression testing? We can look to the ground-breaking engineering efforts on projects which have defined the human race: Voyager I and II, the J.Webb Space Telescope, CERN's particle accelerators, and many others. What's the difference? Time and planning, adhering to standards, routine audits, change controls, and many more.\n\nHow about simpler projects? Do they attend to P&R as well as JBL or CERN or Los Alamos? Unfortunately not. Over the course of nearly a quarter century of focus on this and related topics, the strong majority of orgs which I've had the pleasure of working at have engaged in \"Spectrum Testing\" instead of \"Binary Testing\" when it comes to performance + regression analysis, expecting that half-measures will be sufficient. They are not, and because this area of engineering requires investment of time, people, and hardware, it often becomes a budgetary line item to cross out during the times in which it is most critical. Such is the reality of simple and sometimes willful ignorance. Humans are fallible, expectedly so, but the beautiful thing is that we can change and learn and improve; but how... through awareness, analysis, and iterative adjustment (just like in engineering).\n\nInvesting partially, whether fiscally or in human hours, is not sufficient. Planning these elements for success always requires time, hardware, and people: investment and awareness. No one sends a telescope into Lagrange orbit one half-million miles from earth without proper test coverage (this isn't the Hubble (sorry, sorry, I know it's not funny)). The reasons are obvious. However, back on terra, faulty and insufficiently tested code can deploy to a hyperscaler's cloud with sufficient impact that national and global infrastructure goes offline, and that code can ship without a second set of eyes? Yep. It happens, but it does not need to happen. We can expect better, and we should. Engineers and end-users and everyone else deserves better.\n\nEasier said than done, sure, but there are no improvements without intention and action. Orgs must be dedicated to P&R coverage, and they must be receptive to potential improvements and course corrections. It requires management to be aware that \"performance\" does not imply \"efficiency\" and vice-versa. Quite simply, gaining any benefits from sufficient test coverage requires that management embrace improvements to \"testing culture\" within their org, and to ensure that sufficient time/cycles/bandwidth on each engineering team's schedule is inclusive of engagement with org-wide performance engineering directives.\n\n[1] LinkedIN image reference: [www.linkedin.com/feed/upda...](https://www.linkedin.com/feed/update/urn:li:activity:7229901279039291394)\n\n",
				"date_published": "2024-08-15T16:22:48-05:00",
				"url": "https://prose.winterschon.com/2024/08/15/performance-regressions-how.html"
			},
			{
				"id": "http://winterschon.micro.blog/2024/05/23/test-post-the.html",
				"title": "Everyone Loves Ansible",
				"content_html": "<p>Test post. The variable value specifies the vicissitudes of vectorized validity of variablities.</p>\n",
				"content_text": "Test post. The variable value specifies the vicissitudes of vectorized validity of variablities.\n",
				"date_published": "2024-05-23T16:00:51-05:00",
				"url": "https://prose.winterschon.com/2024/05/23/test-post-the.html"
			}
	]
}
